
        "AGARIYA",
        "The Agariya tribe, listed as a Scheduled Tribe in Madhya Pradesh and holding the top rank in this category, had a recorded population of 41,243 individuals according to the 2011 census, constituting 0.057% of the state's total population. Known as 'Asur' in Bihar, this tribe is widely distributed across various districts in Madhya Pradesh, including Sheopur, Morena, Bhind, Gwalior, Datia, Shivpuri, Tikamgarh, Chhatarpur, Panna, Sagar, Damoh, Satna, Neemuch, Dewas, Dhar, Balaghat, Guna, Ashoknagar, Shahdol, Anuppur, Sidhi, Singrauli, Jhabua, Vidisha, Bhopal, Jabalpur, Shadol, Mandla, Dindori, and Sidhi. The primary residence areas for the Agariya tribe are Shadol, Mandla, Dindori, and Sidhi districts.",
        "The Agariya tribe has emerged as a distinct sub-tribe separate from the Gond tribe, with folklore narrating a dispute between two brothers from the Gond tribe, leading to the creation of this new independent tribe. The legend tells of the younger brother leaving home, building a hut in the forest, and discovering ironmaking as a livelihood. The descendants were named \"Agariya\" due to their association with fire (agni).",
        "Residing in remote forested, hilly, and rural areas alongside other tribes such as Gond, Bhumiya, Baiga, Kanvar, and Uranv, the Agariya tribe constructs mud houses with thatched roofs made of grass or local thatch. Women adorn tattoos on their hands, feet, face, forehead, and chin. Men wear Pancha (small dhoti) and Agarkha (bandi), while women wear lugda. Their main food includes rice, kodo, kutki rice, page, maize bread, urad, moong, horse gram, and seasonal vegetables. Non-vegetarian items like fish, chicken, goat, deer, wild pig, and rabbit are part of their diet, and they make liquor from Mahua.",
        "The primary occupation of the Agaria tribe is ironmaking from iron ore, crafting tools like sickles, shovels, axes, hoes, plow irons, and arrowheads. They also collect tendu leaves, mahua, gulli, and wild roots from the forest. Those with agricultural land sow maize, kodo, kutki, urad, and moong. Fish is caught during the rainy season for personal use.",
        "The Agaria tribe follows a patrilineal, ancestral, authoritative, and locally rooted system. Sub-castes include Patharia and Khuntiya, with Pathriya Agariyas making tools on a stone and Khutia Agariyas making tools with hot iron on an iron peg. The tribes have different matrimonial gotras, and main clans include Baghel, Dhurwa, Markam, Uika, Tekam, Sonwani, Marawi, Marai, Masram, Kaream, Nag, Tilam, Besra, etc.",
        "Rituals during pregnancy involve deliveries at home by local elderly women. After birth, a decoction of Mahua, Jamun, Tendu bark, Atigan, Popod, jaggery, etc. is given to the pregnant woman. Marriage age is considered to be 16-18 for boys and 15-17 for girls. The marriage proposal is made by the groom's side, and a ceremony is performed by elders. Widow and abandoned people are allowed to remarry.",
        "After death, the deceased is buried, and on the third day of Teej, family and relatives cut the hair of men. A funeral feast is held on the 10th day. The tribe has a traditional caste panchayat, with the head called Gautiya, settling disputes related to marriage, divorce, bride price, and immoral relations.",
        "Diversity is observed in the culture of tribes in different areas of the state, encompassing family structure, marriage customs, kinship, food, clothing, and traditions. The Agariya tribe engages in Karma dance, Padki dance, and marriage dance on various occasions, celebrating festivals like Navakhani, Dussehra, Deepawali, Holi, and Karmapuja. They believe in gods like Budhadev, Lohasur, Thakurdev, Dulhadev, Shitalamata, Baghdev, Jogni, Ghurlapat, as well as Hindu deities, and also acknowledge ghosts and witchcraft. Traditional songs like Karmageet, Dadriya, Suageet, Vivahgeet, Phaggeet, and Bhajan are integral to their cultural expressions.",
       
        "ANDH",
        "The Andh tribe is primarily found in Maharashtra and is listed at serial number 02 in the Scheduled Tribes of Madhya Pradesh. According to the 2011 census, their population in Madhya Pradesh is recorded as only 137, constituting 0.000 percent of the state's total population. The main residential areas for this tribe are Akola, Nanded, Parmani, etc. districts, and they are also found in districts like Shivpuri, Indore, Bhopal, Betul, Jabalpur, Seoni, Balaghat, and Singrauli.",
        "The origin of the Andh tribe is not precisely documented, and there are various theories, including being described as \"Andh Gond\" by Sherring, considered a branch of the Gond tribe by S.S. Hasan, and linked to migration from Andhra Pradesh to Maharashtra by Kitts.",
        "In terms of lifestyle, the Andh tribe builds houses at one end of the village, separate from non-tribal communities. Their dwellings are made of mud, typically consisting of two rooms—one for the kitchen and the other as the main residence. The houses lack a veranda or courtyard. Thatching is done using grass or native tiles. In terms of clothing, men wear \"Dhotar\" (Dhoti) Bandi or Kurta, with headgear like \"pagote\" (turban) or cap. Women wear lugda and choli, with married women adorning Mangalsutra and \"Jodve\" (toe ring). Tattoos on the forehead, chin, and cheeks are common, with a belief that having a forehead tattoo is necessary for a place in heaven.",
        "Their primary food includes jowar roti, raab, urad, tur, moong, barbati dal, seasonal vegetables, and occasionally wheat bread and rice. In the non-vegetarian diet, they consume meat from fish, goat, chicken, pig, nilgai, and rabbit. Liquor made from Mahua is part of their practices, and men smoke.",
        "Traditionally engaged in agriculture, hunting, food gathering, and fishing, the Andh tribe has transitioned to occupations like labor and various jobs. Agriculture remains a significant activity, producing crops like jowar, bajra, maize, groundnut, cotton, moong, tur, urad, among others.",
        "Andh Patrivashi is a patriarchal, ancestrally local tribe with two sub-groups, Vartati and Khaltati. They have exogamous divisions known as 'Adnam' (Gotra) with various chiefs like Adnam Bansale, Dukere, Devkar, Fafre, Gohad, Khairkar, Khadke, Magre, Matkari, Natkar, Pardhi, Survakar, Tadche, Thote, Umare, Waghmare, Ogham, Deshmukhi, Dhanve, Bhaibhare, Gaekwad Bhedkal, etc.",
        "Rituals include home deliveries conducted by local \"daya\" (dayi), and Panchami is performed on the fifth day after delivery. Naming ceremonies and other rituals follow. Marriage age ranges from 16 to 20 for boys and 12-16 for girls. Marriages involve the exchange of cash, grains, pulses, and turmeric as bride price. Widows, widowers, and divorcees are allowed to remarry.",
        "After death, the deceased is either buried or cremated, with rituals continuing for ten days. A funeral feast is given, and the \"Punyati Tithi\" anniversary is celebrated.",
        "The Andh tribe follows a traditional caste panchayat system with a chief called \"Mohatriyaan,\" and decisions are made on various matters, including matrimonial disputes, bride price determination, divorce, property division, immoral relations, and inter-caste marriages.",
        "In Maharashtra, the Andh tribe follows different rituals related to birth, naming ceremonies, marriage, and festivals. They worship deities like Maruti, Mahadev, Mari Aai, Mata, Bhimsen, Waghmai, Khandoba, Kanhoba, Masai, Munja, Krishna, with sacrifices of cock and goat. Their main festivals include Akhadi, Gudi Padwa, Nagpanchami, Pola, Dussehra, Diwali, Holi, Mahashivratri, and they hold beliefs in ghosts, witchcraft, and mantra-tantra.",
       
        "BAIGHA",
        "The Baiga Tribe in Madhya Pradesh has been recognized as a special backward tribe and is notified as a Scheduled Tribe for the entire state, holding position 03 in the Scheduled Tribe list. According to the 2011 Census, the Baiga tribe's total population in Madhya Pradesh is 414,526, constituting 0.571 percent of the state's total population. The Baiga tribe predominantly resides in districts such as Madnla, Dindori, Shahdol, Sidhi, Katni, Jabalpur, Balaghat, Sidhi, Singrauli, and Anuppur.",
        "The origin of the Baiga tribe is uncertain, with scholars like Russell and Grierson suggesting they might be a distinct group related to Bhumiya or Bhuiya. According to legend, when Lord Brahma created the universe, he gave an axe to one person, who became the ancestor of the Baiga tribe, known as \"Nanga Baiga\" due to the absence of clothes at that time.",
        "The Baiga people practice shifting agriculture, leading to a nomadic lifestyle. Their homes are constructed with bamboo, wood, and mud, often situated on hill slopes or near agricultural land. Baiga men have a simple dress, dark complexion, and distinctive features like matted black hair, bows and arrows, and a small axe. Women wear various types of lugdas and consider tattooing as a significant ornament.",
        "The Baiga tribe's economy relies on forest resources, agriculture, animal husbandry, and manual labor. They cultivate crops such as maize, jowar, paddy, kodo, kutki, sawa, rye, tivda, ramtila, moong, and others. The Baiga community is divided into several endogamous sub-castes with various exogamous gotras. The tribe practices patrilineal and patriarchal social structures.",
        "Traditional practices during childbirth, marriage, and death are observed within the Baiga tribe. Marriages typically occur between the ages of 14-18 for boys and 12-16 for girls. The tribe celebrates various festivals such as Chhathi, Holi, Pola, Navakhai, Bidri Puja, Dussehra, and Karma Puja. They follow a polytheistic belief system, and their main deities include Thakur Dev, Narayan Dev, Khairmai, and Manpati Mai.",
        "The Baiga tribe's vibrant cultural environment is reflected in their clothing, dances, and rituals, showcasing a unique and diverse aspect of Madhya Pradesh's tribal world. The community is known for its hardworking nature, and their entertainment includes dancing and singing, with traditional dances like Karma, Lahki, Reena, and Saila. The Baiga people also believe in witchcraft and ghosts, with Bhumka serving as the priest for their deities and exorcist for ghosts.",
        
        "BHAINA",
        "The Bhaina Tribe in Madhya Pradesh holds the distinction of being notified as a Scheduled Tribe for the entire state, securing the fourth position in the Scheduled Tribe list. As of the 2011 census, their population stands at 6,367, constituting 0.009 percent of India's total population. This tribe is predominantly located in districts such as Morena, Bhind, Gwalior, Shivpuri, Sagar, Umaria, Neemuch, Mandsaur, Ratlam, Ujjain, Shajapur, Dewas, Dhar, Indore, West Nimad, Bhopal, Raisen, Hoshangabad, Katni, Jabalpur, Narsinghpur, Dindori, Mandla, Chhidwara, Seoni, Balaghat, Guna, Shahdol, Anuppur, and Sidhi, with negligible presence in other districts.",
        "The origin of the Bhaina tribe remains undocumented, with some scholars proposing a potential connection with the Baiga caste. In Mandla district, a group known as Rajbhaina can be found within the Baiga tribe. Legends suggest that Bhaina tribes were once landlords in Pendra of Bilaspur and Phuljhar of Raipur but were defeated and displaced by the Kanwar and Gond tribes.",
        "The Bhaina tribe coexists with Gond, Kanwar, Savra, and other tribes in villages, constructing houses from mud with roofs made of native tiles or grass. Their daily lives involve activities such as brushing teeth with Neem or Harra sticks, daily baths, and women adorned with tattoos and various jewelry items. Traditional attire for men includes pancha-bandi saluka, dhoti, and kurta, while women wear lugda and polka.",
        "Their staple foods consist of rice, Kodo rice, pulses, seasonal vegetables, and non-vegetarian items such as fish, chicken, and goat meat. Mahua liquor is a common beverage, and men smoke beedis. The primary sources of livelihood for the Bhaina tribe are agriculture, labor, and the collection of forest produce. Although they engaged in hunting in the past, restrictions have led them to abandon this practice.",
        "The Bhaina tribe adheres to a patriarchal, patriarchal, and ancestral local tradition, with sub-castes such as Laria or Chhattisgarhia, Oriya, Jhalayara, and Ghatiyara. Some sub-castes are endogamous, and others are divided into exogamous gotras. Rituals during pregnancy are minimal, and deliveries are typically assisted by local \"suindai.\" Marriage ages range from 16-18 for boys and 15-17 for girls, with various marriage customs observed.",
        "Upon death, the Bhaina tribe buries the deceased, and rituals include shaving beards, mustaches, and head hair. The tribe worships their ancestors, offers a death feast, and follows traditional practices.",
        "The Bhaina tribe is known for its cultural practices, including dances such as Karma, Rahas, Ramdhuni, and Bihav. Their main deities include Thakurdev, Budhadev, Goriyadev, and Shitalamata, and they celebrate festivals like Hareli, Teeja, Pola, Pitar, Nawakhani, Dussehra, Diwali, and Holi. Believers in ghosts and witchcraft, the Bhaina tribe consults individuals knowledgeable in magic and mantra, known as Baiga.",
        "A traditional caste panchayat exists within the tribe, with a Gotiya serving as its head. This panchayat handles matters such as deciding bride prices, resolving marriage and divorce disputes, controlling immoral relationships, and organizing worship for the caste's gods and goddesses.",
        "In addition to traditional ceremonies and practices, the Bhaina tribe expresses its culture through dances like Karma, Rahas, Ramdhuni, Bihav, and songs such as Karmageet, Dadriyageet, Rahasgeet, Bhajan, Suageet, and Bihaav Geet.",
        
        "BHARIYA/BHUMIYA",
        "The Bhariya/Bhumiya Tribe in Madhya Pradesh is recognized under different names in various regions due to differences in local dialects. In Chhindwara and Seoni districts, they are known as Bhariya, while in Jabalpur, Mandla, and Shahdol, they are referred to as Bhumiya. This tribe holds the fifth position in the Scheduled Tribe list for the entire state of Madhya Pradesh. The population of Bharia/Bhumiya in Madhya Pradesh, according to the 2001 and 2011 censuses, is spread across multiple districts, including Morena, Bhind, Gwalior, Datia, Shivpuri, Panna, Sagar, Damoh, Satna, Rewa, Umaria, Shahdal, Sidhi, Neemuch, Mandsaur, Ratlam, Ujjain, Shajapur, Dewas, Jhabua, Dhar, Indore, West Nimar, Barwani, East Nimar, Rajgarh, Vidisha, Bhopal, Sehore, Raisen, Betul, Harda, Hoshangabad, Katni, Jabalpur, Narsinghpur, Dindori, Mandla, Chhidwara, Seoni, Balaghat.",
        "Additionally, there is an economically, socially, and educationally backward sub-caste known as Pando, residing in Surguja and Bilaspur districts of Chhattisgarh. The total population of the Bhariya/Bhumiya tribe, as of the 2011 census, is 193,230, making up 0.266 percent of the total population of the state.",
        "The origin of the Bhariya, Pando, and Bhumiya tribes is not historically documented. According to legends, they trace their ancestry back to the Pandavas, particularly Arjun, who transformed Bharu grass into a soldier using mantra power. Bharia and Pando people consider the Pandavas as their ancestors. Bhumiya sub-caste believes that Lord Mahadev created the land, rivers, mountains, trees, animals, and birds with his trident, and a man and a woman for the enjoyment of this land. Their son, named Bhumiya, performed Bhoomi Pujan and worship of Gods and Goddesses.",
        "The Bhariya tribe, along with Gond, Pardhan, Ojha tribes, resides in remote villages of Chhindwara and Seoni districts. Similarly, Bhumiya tribes, along with Baiga, Kol, Gond, are found in villages of Jabalpur, Mandla, and Shahdol districts. Pando, Bhuiya, and Bhunihar tribes of Surguja, Raigarh, Bilaspur, along with tribes like Gond, Tanwar, Pardhan, Oraon, Munda, reside in remote villages of the district. Their houses are mostly constructed with mud, featuring roofs made of grass or country tiles. The walls are coated with white or yellow mud, and the houses contain granaries, mills, pestles, bamboo baskets, utensils for cooking, and separate spaces for animals.",
        "Women in the Bhariya/Bhumiya tribe adorn tattoos on their forehead, hands, feet, skull, chin, and neck, along with various jewelry items. Their clothing includes Paadi, Toda, Chudiya, Kakna, Guletha Vohta, Hamel, Sariya, Umetha, Long, dhoti, pancha, bandi, kurta, polka, and lugda. The main diet consists of maize, jowar roti, kodo, rice bhaat, pulses, seasonal vegetables, and non-vegetarian items like chicken, pheasant, fish, crab, and goat meat. They also consume liquor made from Mahua.",
        "The primary economy of the Bhariya/Bhumiya tribe revolves around primitive agriculture and forest produce collection. Even today, agriculture, agricultural labor, and forest produce collection remain essential aspects of their livelihood. Different sub-castes like Bhumiya, Bhariya, Bhuniya, Bhuinhaar, and Pando exist within this tribe, and each sub-caste is divided into various gotras. For example, the Bharia tribe in Chhindwara has major clans such as Kumra, Uika, Tekam, Parteti, Pendram, Dhurva, Bhalawi, Bagdaria, Gonwalia, Khamaria, Thakaria, Bhartia.",
        "The Bhariya/Bhumiya tribe follows a patrilineal, patriarchal, and ancestrally local structure, with Vahirvipahi as their Gotra. The tribe practices a traditional rite of passage during pregnancy. Deliveries are typically conducted at home by local midwives or elderly women, and the birth is followed by the celebration of Chhathi on the sixth day. Marriage is expected at the ages of 17-18 for boys and 15-16 for girls. The groom gives Kodo and rice, pulses, oil, jaggery, and cash as expenses. Marriage rituals are overseen by village elders or caste panchayat chiefs. Home marriages, remarriages, and other customs are also observed.",
        "After death, the Bhariya/Bhumiya tribe buries the deceased, and on the third day, men and relatives of the family shave their beard, mustache, and head hair. The house is cleaned and plastered, and on the eleventh day, a funeral feast is held.",
        "A traditional caste panchayat, led by a \"Mukhiya,\" is present within the Bhariya tribe. The caste panchayat's main functions include handling social work related to the caste, addressing marital relations, resolving disputes, and arranging worship of Gods and Goddesses.",
        "The original mother tongue of the Bhariya tribe is called \"Bharnoti\" or Bhariadhi, but at present, few use it in its original form. The influence of Gondi is evident in their dialect. The Bhariya tribe celebrates festivals like Vidari, Asadi, Jeevati, Panchami, Diwali, Rahas in Holi, Gunnur in Pola, Vihav in marriages, along with various dance forms such as Saila, Rahas, Gunnur, Bihav, and Phadki. Folk songs like Phag in Holi, Ahirai songs in Diwali, Seva songs in Jawara are prevalent in their culture.",
        "The Bhariya tribe follows a religion based on faith in particular deities. Some of their main gods and goddesses include Hardul Dev, Bada Dev, Thakur Dev, Budhibai, Bhaisasur, along with worship of Hindu deities like Sun God, Nagdev, Vriksha Nadi. They celebrate festivals by offering cocks and goats to the gods. Individuals knowledgeable in Tantra Mantra are called Bhumka.",
        "Dance forms like Shaila in Diwali, Rahas in Holi, Gunnur in Pola, Bihav in marriages are performed by the Bhariya tribe. Women participate in Phadki dance, and major folk songs include Phag, Ahirai, Seva.",
        
        "Bhatra",
        "The Bhatra tribe is primarily located in the Bastar district of undivided Madhya Pradesh, and they are recognized in the Scheduled Tribe list of Madhya Pradesh at number 06. According to the 2011 census, the Bhatra tribe's population in Madhya Pradesh is 1155, constituting 0.002 percent of the total state population. This tribe is also known as Bhotada in Orissa and has a presence in Maharashtra. The population of the Bhatra tribe in Madhya Pradesh can be found in districts such as Morena, Bhind, Gwalior, Sagar, Satna, Neemuch, Ratlam, Ujjain, Dewas, Indore, Bhopal, Harda, and Katni, based on the 2001 and 2011 censuses.",
        "Although there is no specific historical evidence regarding the origin of the Bhatra tribe, according to their oral traditions, their ancestors served as ministers and confidants to the king of Bastar. They were entrusted with guarding and household responsibilities, leading to their designation as ministers in the palace. Over time, this evolved into the term \"Bhatara.\"",
        "The villages of the Bhatra tribe are divided into several partitions, where people from other tribes also reside. Their houses are typically made of mud, and household items include cots, janta (grinding stone), chakki (hand-operated mill), pestle, covering clothes, and utensils made of various materials like aluminum, iron, clay, and steel. Agricultural tools, axes, ploughs, bullock carts, and fishing nets are commonly found in their households.",
        "Bhatra men and women follow a daily routine of waking up early, brushing their teeth with neem or acacia branches, and taking a bath. Women often have various shapes tattooed on their hands, legs, and bodies. In terms of clothing, men wear dhoti (Gonchi), while women traditionally wear lugda (dhoti), but nowadays some also wear sarees. The main food of the Bhatra tribe includes rice, urad, moong, kulthi dal, seasonal vegetables, and non-vegetarian items like fish and chicken. Men may consume tobacco and beedis.",
        "The primary economic activities of the Bhatra tribe include agriculture, wild produce collection, woodcutting in the forest, and agricultural labor. The main crops cultivated are Kodo, Paddy, Pigeon pea, and Moong, though the lack of irrigation facilities limits the yield. Wild produce like mahua, honey, gum, and tendu leaves are collected and sold in the market.",
        "The Bhatra tribe is divided into sub-castes, including Pit Bhatra, Amnet Bhatra, Sen Bhatra, where Pitta is considered high, Amanate is considered medium, and Senbhatra is considered low. These sub-castes further have various gotras, with prominent ones being Kashyap, Mohre, Baghel, Nag, and Bakra, along with associated totems.",
        "Pregnancy rituals in the Bhatra tribe involve no specific rites. Deliveries take place at the husband's home, supervised by elderly women and village midwives. A pit is dug at the birthplace, and the child's nara (umbilical cord) is buried in it. Pregnant women are given a decoction of wild herbs and jaggery for three days. Chhathi, a celebration on the sixth day after childbirth, involves bathing the mother and child, paying obeisance to the family deity, and hosting a feast for relatives.",
        "The marriage age for girls is generally 17-19 years, and for boys, it is typically 18-20 years. Boys initiate the marriage proposal, and marriage rituals involve the exchange of various items between the groom's and bride's families. Remarriage and widow remarriage are accepted according to social customs.",
        "After death, the Bhatra tribe may either bury or burn the deceased based on financial circumstances, with children usually being buried. The tenth day, known as Dashakaram, involves a funeral feast, shaving of the beard, mustache, and head hair of male family members, and the presence of all relatives.",
        "The Bhatra tribe has a traditional political organization for social justice known as the caste panchayat, led by a head called Ghember. The panchayat's main function is to resolve family disputes and caste-related matters.",
        "Dances like Karma, Ramsatta, and folk songs like Gaura Geet, Rahas Geet are prevalent among the Bhatra tribe. Ramlila drama is played during Navratri. The main deities worshipped by the Bhatra tribe include Thakurdev, Budhababa, Mata Devi, Pardeshin Mata, Danteshwari Devi, Budhimai, along with Lord Hanuman, Shiva, and Durgamata. Festivals such as Hariyali, Navakhai, Nagpanchami, Dussehra, Holi, and Diwali are celebrated, and they believe in ghosts and witchcraft. Those knowledgeable about Tantra Mantra are referred to as \"Siraha.\" Traditional dances of the Bhatra tribe include Karma dance, Rahas, Ramsatta, and they also engage in the performance of the Ramlila drama during Navratri. Folk tales and folk songs are an integral part of their cultural traditions.",
       
        "BHIL",
        "The Bhil tribe is one of the largest tribes in Madhya Pradesh, and they are recognized in the Scheduled Tribe list of the state at number 07. They are also found in Gujarat, Rajasthan, and Maharashtra. According to the 2011 census, the total population of the Bhil tribe, including its sub-castes Bhilala, Barela, and Patelia, is 5,993,921, making up 8.253 percent of the total population of the state. The Bhil tribe is predominantly located in Bhil-Dhar, Jhabua, Barela-Khargone, and Patelia Dhar, Jhabua. Their presence can be observed in numerous districts across Madhya Pradesh.",
        "Historically, the Bhil tribe is mentioned in ancient literature, with references to Shabari Bheelni in the Ramayana and Ekalavya Bheel in the Mahabharata. The term \"Bhil\" is derived from the Dravidian language, where \"Billu\" means arrow, possibly referring to the tribe's proficiency in archery. The Bhil tribe is considered ancient, predating both the Aryans and Dravidians. In Bhagwat and Purana, they are described as the descendants of King Ben, and during the Ramayana period, the Bhil and Kol lived together in the Vindhya Mountain range before migrating to the west coast.",
        "Bhil villages are divided into several \"Falia\" or \"Tolo,\" and their houses are simple, made with a coating of cow dung soil from outside, thatched roofs with grass or native materials, and mud floors. The household items include cots, mills, pestles, bows and arrows, swords, axes, clothing, and utensils made of clay and aluminum. Agricultural tools such as plows are common, and every house possesses bows and arrows, reflecting the tribe's historical proficiency in archery.",
        "Bhil men and women follow a daily routine that includes waking up early, brushing their teeth with branches of olive, neem, etc. Women wash their heads with clay, apply oil to their hair, and tie it into a bun. Traditional ornaments like Kadla, Kata, Hasli, Sakri, Bori, Gujariya, and Bhariya are worn by women, made of silver or gilt. Men and women get tattoos on various parts of their bodies. Traditional clothing includes ghagra, choli, oudhani for women, and Bandi, small dhoti, and a white turban for men.",
        "The primary food of the Bhil tribe includes maize bread, urad dal, tuvar dal, and seasonal vegetables. Non-vegetarian items like meat from chicken, goat, fish, and rabbit are also part of their diet. Additionally, they consume toddy, tobacco, and beedis.",
        "The economic life of the Bhil tribe revolves around agriculture, wild produce collection, and labor. Maize is their main crop, and they also cultivate Kodo, Pigeon pea, Urad, etc. Wild produce like Mahua, Gulli, and lac are collected and sold. Some Bhil families migrate to cities for labor after the harvest.",
        "The Bhil tribe is divided into sub-castes, including Bhil, Bhilala, Barela, Pateliya, Tadvi, Mankar, Naikra, etc. Many sub-castes have evolved into independent endogamous castes, with Bhilala considered prominent. Bhilala, for example, does not intermarry or share food with other sub-castes. Each sub-caste has various exogamous Atakas or Gotras, including Katara, Damor, Ninama, Nanot, Patela, Makwana, Gamar, Garasia Tawar, Dana, Bhuria, Solanki, etc.",
        "In the Bhil tribe, delivery is typically done at home under the supervision of elderly women and midwives. Chhathi is celebrated on the sixth day after childbirth, involving bathing the baby and the mother and presenting them to the family deities.",
        "The marriage age for Bhil boys is generally considered to be 14-16 years. Marriage rituals include Morvandia marriage, Daya (Vadhumulya), Mihi Jambu (abduction marriage), Gol Gachhedo (examination marriage), Udadi (hut marriage), Khandaniya (house marriage), Vinamay (hath path marriage), and Natra tradition.",
        "After death, the Bhil tribe may bury or burn the deceased based on financial circumstances, with children usually being buried. Shraddha rituals are not performed immediately after death but are conducted later, followed by a feast called Kayantu. For those who died prematurely, a Sati obelisk for women and a Gatha obelisk for men are made.",
        "The Bhil tribe has a traditional caste panchayat at the village level for social justice. This panchayat resolves disputes, determines bride prices, prevents endogamous marriages, and oversees the worship of family deities.",
        "The Bhil tribe has a rich cultural heritage with specific festivals like Holi, Navratri, Diwaso, Diwali, Rakshabandhan, Bhagoria Utsav, and others. Their cultural expressions include dances like Bhagoriya (Bhongarya) dance, marriage dance, Ghedia dance, Pithora painting, and various songs sung during festivals. The Bhil people celebrate their festivals with reverence to their gods and goddesses, expressing their beliefs and traditions. Pithora style in wall paintings is a distinctive symbol of their artistic expression.",
        "The main deities worshipped by the Bhil tribe include Kaka Baliya, Shikovati, Indraj, Simriyan Dev, Baghdev, Kalka, Meldi, and Jogan. In addition to these, they also worship Hindu gods and goddesses. Their festivals involve rituals, sacrifices of animals like cock and goat, and belief in ghosts and witchcraft. Those knowledgeable about mantra magic are called Barwa.",
        "Bhagoria (Bhongarya) dance, marriage dance, Ghedia dance, and songs like Bhagoria songs, Ghedia songs are integral to Bhil cultural celebrations. The Bhil tribe has a unique way of expressing their faith and traditions through their festivals, dances, and artistic endeavors.",
       
        "BHIL MEENA",
        "The Bhil Meena tribe is a minority tribe in Madhya Pradesh, listed at number 08 in the state's Scheduled Tribe list. The majority of their population is found in Rajasthan, with an estimated population of 2,244 in Madhya Pradesh, constituting 0.003 percent of the total state population. The Bhil Meena tribe primarily resides in districts such as Mandsaur, Ratlam, Shivpuri, Morena, Gwalior, Neemuch, Shajapur, Dewas, Jhabua, Dhar, Indore, East Nimar, West Nimar, Rajgarh, Raisen, and Mandla.",
        "There is no historical record available regarding the Bhil Meena tribe, and it is considered a relatively new caste originating from the Bhil and Meena castes. They live in villages alongside other tribes like Bhil, Damor, and various castes. Their houses are made of mud, with bamboo and native tile roofs and mud thatch on the walls. Household items include granaries, soil, aluminum utensils, farming equipment, clothes, and musical instruments.",
        "In terms of clothing, men wear dhoti, bandi, and a turban, while women wear ghagra and odhni. Women often get tattoos and wear jewelry, such as Guria made of glass beads, Sutiya, silver bracelets, bracelets on their legs, a waist scarf, nose rings, and a sack on their heads. Imitation silver is commonly used for their jewelry.",
        "The main food of the Bhil Meena tribe includes maize, jowar, bajra, wheat roti, urad, tuvar dal, seasonal greens, vegetables, chicken, goat meat, fish, and liquor made from Mahua.",
        "The main occupation of the Bhil Meena tribe is dependent on agricultural labor, with unirrigated farming of maize, jowar, urad, moong, and tuvar. Due to the rocky land, crop yields are low, and some people migrate to Ratlam, Mandsaur, and cities in Gujarat and Rajasthan to work as laborers. Some also collect Gulli in Chaitra and sell it in Mahua and Ashadha.",
        "The Bhil Meena tribe is divided into two groups, Ghujale and Maile. The white group is called Bhagat, who have given up alcohol and non-vegetarian food after coming in contact with a religious sect, while the dirty group consumes alcohol and non-vegetarian food. The tribe is further divided into exogamous Ataka (Gotras) with gotras like Chabana, Dayana, Parmar, Rathore, Rawat, Solanki, Makwana, etc. Each clan has its own goddess, and the family is patrilineal and patrilocal.",
        "During the first pregnancy, the Bhil Meena tribe has a ritual called \"Khodo Bharne.\" Delivery is typically done at home under the supervision of elderly women and Suwarni (Dai). The pregnant woman is given wheat porridge, jaggery, ghee, urad laddus, saut, pepper, and a decoction of herbs. On the seventh day, the child and mother are bathed, and \"Sava\" puja is performed. A feast is served to relatives, and naming ceremonies are often conducted by Brahmins.",
        "Marriage proposals are initiated by the groom's side, with the age of marriage considered around 14-18 years for boys and 12-16 years for girls. The groom's father pays bride price to the bride's father in cash and animals. Marriage ceremonies are first performed by the caste head. Socially recognized marriage types include co-migration, exchange, service marriage, Natra, brother-in-law-sister-in-law marriage, among others.",
        "Upon death, there is a custom of burning the deceased, while small children are buried. The house is cleaned, men shave their heads, and on the 13th day, a death feast takes place. There is also a tradition of making a saga on untimely death.",
        "The Bhil Meena tribe has a traditional caste panchayat with a chief called \"Patel,\" whose position is usually passed from generation to generation. The panchayat settles disputes related to bride price, marriage, divorce, immoral relations, inter-caste marriage, and other matters. Social feasts and financial punishments are enforced through fines.",
        "Women of the Bhil Meena tribe are fond of tattooing and jewelry. The main deities worshipped include Bhairon ji, Mata ji, Nagdev, Shyamala, and Shyamalaji. Those belonging to the religious community are called Bhagat, and their priest is known as Barwa. Traditional dances are performed during festival occasions like Holi, Gol Ghedi, and bhajans are sung during pujas, wedding songs at marriages, and phagas during Holi.",
        "The main deities of the Bhil Meena tribe are Bhairoji, Mata, Nagdevata, Shyamalaji, along with the worship of Hindu gods and goddesses during festivals like Rakshabandhan, Janmashtami, Navratri, Dussehra, Diwali, and Holi. Festivals involve the worship of gods and goddesses, with sacrifices of animals like cocks and goats. The tribe believes in ghosts and witchcraft, and their religious priest is called \"Barwa.\"",
        "People of the Bhil Meena tribe express their faith through dance during occasions like marriage and Holi. Bhajans are sung during pujas, wedding songs at marriages, and phagas during Holi, contributing to the cultural richness of the tribe.",
        
        "BHUNJIA",
        "The Bhunjia tribe is a minority tribe in Madhya Pradesh, listed at number 09 in the Scheduled Tribe list for the entire state. They are primarily found in the Chhattisgarh region of the undivided Madhya Pradesh, especially in Bindranavagarh tehsil of Raipur district. The tribe has some social divisions, including Chaukhatiya Bhunjia and Chinda Bhunjia.",
        "The population of the Bhunjia tribe in Madhya Pradesh was estimated at 1,469, constituting 0.002 percent of the total state population, according to the 2011 census. They are found in various districts, including Morena, Gwalior, Panna, Sagar, Satna, Rewa, Shahdol, Sidhi, Ratlam, Ujjain, Dewas, Jhabua, Dhar, Indore, East Nimar, Barwani, West Nimar, Bhopal, Sehore, Raisen, Betul, Harda, Hoshgabad, Katni, Jabalpur, Chhindwara.",
        "The origin of the Bhunjia tribe is not well-documented. Chaukhatia is believed to be a tribe originating from the mixture of Bhunjia, Gond, and Halba tribes. According to Rijle, Chinda Bhunjia's origin is thought to be from the marriage of Vinjhwar and Gond tribes.",
        "The villages of the Bhunjia tribe are often surrounded by hills and forests, and they also reside in plain areas. Their houses are usually crude, made of wood, mud, kukhaar (kodo) para, and ropes. Roofs are covered with grass or country tiles. Chaukhatiya Bhunjia people construct different \"Randha Ghar,\" with walls painted with red soil. They paint the house by mixing colors with cow dung, yellow soil, red soil, and lime. The floor is smeared with cow dung, and various figures called \"Peda\" are made on the walls. Adornment is simple due to financial poverty, and women love getting tattoos on their bodies. Men typically wear dhoti and vest, while women wear saree, known as Lugda. The Purdah system is not practiced.",
        "For agricultural work, the Bhunjia tribe uses tools like Nagar, Kurar, Mopar, Kuradi, Juwadi, Genti, Tangiya, Supa, Kanwar, Khurpi. Hunting involves arrows and bows, and kumini is used for fishing. Rice is the main food of the tribe, often accompanied by horse gram or urad dal, green vegetables, and meat such as goat, chicken, rabbit, and fish. The Bhunjia tribe is mainly dependent on agriculture, wild produce collection, and labor for their economic life. They used to hunt in the forest, but now they mainly focus on agricultural production like paddy, kodo, urad, arhar, tivda, sesame, and the collection and sale of wild produce like mahua, gum, tendu leaves.",
        "The Bhunjia tribe is patrilineal, patriarchal, and follows ancestral residence. There are two sub-castes: Chaukhatia Bhunjia and Chinda Bhunjia. The sub-castes are divided into gotras like Badhwa, Bokra, Cheetah, Bhainsa, Sonwani, Tekam, Markam, Dudh, Sua, which are exogamous groups. Rituals are not performed during pregnancy, and delivery usually takes place at home under the supervision of a local midwife or elder women. Chhathi is celebrated on the sixth day, and before formal marriage, there is a tradition of \"Kaan\" solemnizing the marriage of girls who are pre-menstrual. The formal marriage of a boy and girl takes place when they attain adulthood at the age of 18-20 years. The marriage proposal is made by the groom's side, and the groom's father covers the entire expense. Marriage rituals are performed under the supervision of an elderly person.",
        "After death, the deceased is buried, and on the third day, the house is plastered and bathed. Men shave their beard, mustache, and head hair, and on the 10th day, a funeral feast is held. A traditional caste panchayat exists in the Bhunjia tribe, consisting of Pujeri, Pati, and Diwan. These positions are usually hereditary, and the panchayat settles disputes related to adultery, marriage, and divorce in a traditional manner.",
        "The Bhunjia tribe has its cultural practices, including traditional marriage dances, Phadki dance by women during Diwali, Ramsatta dance by men in Bhadon, and Rahas dance during Holi. Folk songs like Phadki Geet, Dadriya, Vivah Geet are sung, accompanied by musical instruments like madal, tiski, khartal cymbal. The main deities worshipped by the Bhunjia tribe include Budhadev, Budhimai, Matidev, Kana-Maura, Kalakuvar, Bhainsasur, Thakur Dev, Doomadev, along with Hindu gods and goddesses. They celebrate festivals like Holi, Pola, Teeja, Pitr, Nawakhani, Dussehra, Diwali, worshipping gods and goddesses. The village deity sacrifices a chicken to the family deity every year, and specific deities like Thakurdev and Budhimai receive goat sacrifices after three years. The Bhunjia tribe believes in witchcraft, mantra-tantra, ghosts, and their religious priest and expert in magic mantras is called \"Baiga.\" They perform Vihaav dance during marriages, women dance during Diwali, men perform Ram Satta dance during Phadki in Bhadon, and Rahas dance during Holi. Folk songs like Phadki Geet, Dadriya, Vivah Geet are an integral part of their cultural expression.",
        
        "BIAR",
        "The Biar tribe, listed at number 10 in the Scheduled Tribe list of Madhya Pradesh for the entire state, is considered a minority tribe. Their population is mainly concentrated in Sidhi of Madhya Pradesh and also in Surguja and Bilaspur, Raigarh Chhattisgarh. According to the 2011 census, the total population of the Biar tribe in Madhya Pradesh is 10,452, constituting 0.014 percent of the state's total population. They are found in various districts, including Bhind, Gwalior, Shivpuri, Guna, Satna, Shahdol, Sidhi, Neecham, Indore, Vidisha, Bhopal, Betul, Jabalpur, Dindori, Mandla, Chhindwara.",
        "The origin of the Biar tribe is not documented in historical records, but according to legend, it is believed that Shiva and Parvati created a man and a woman in Vindhyachal. Parvati desired to cultivate paddy, and Lord Shiva created these individuals, who cut the forest, burned it, and cultivated it by sprinkling paddy seeds on the ashes. The Biar people consider this legend as the origin of their caste.",
        "The Biar tribe resides in villages alongside other tribes like Gond, Khairwar, etc. Their houses are made of mud with a wooden cover and have roofs made of native tiles. The houses typically consist of two or three rooms and a verandah. Walls are painted with white clay, and the floor is covered with cow dung. The village houses various rooms for different purposes, such as grain storage, chakki, pestle, clothes, kitchen stove, utensils, and agricultural equipment.",
        "Oral hygiene involves cleaning teeth with sticks made from acacia, karanj, neem, and harra. Daily bathing is a common practice. Hair is washed with clay, and peanut or sesame oil is applied. Women braid their hair and often have tattoos on their bodies. In terms of clothing, men wear Pancha and Bandi, while women wear Lungra Polka. The main food of the Biar tribe includes Kodon, rice bhaat, wheat roti, urad, tuvar, moong dal, seasonal greens, vegetables, and non-vegetarian items such as fish, chicken, and goat meat. Men consume liquor made from Mahua.",
        "The economic life of the Biar tribe is primarily based on agriculture, labor, and the collection of wild produce. They cultivate crops like Kodo, paddy, maize, urad, moong, tuvar, sesame, and collect forest products like Tendu leaves, Harra, Amla for sale in the local market. Fishing is done during the rainy season for personal consumption.",
        "The Biar tribe is divided into two sub-castes: Barhariya and Dakhinaha. Barhariyas believe they originate from the north of the Son River, while Dakhinahas believe they originate from the south. The sub-castes are exogamous, and their gotras include Kanojia, Sarwar, Varwar, Mahato, Kahto, Kashi, Barhar, forming exogamous groups.",
        "There is no specific ritual during pregnancy, and home delivery is assisted by wise elderly women and local midwives. The baby's nare is cut with a knife, and a decoction of dry ginger, saraichal, chihind root, ethimudi, and jaggery is given to the mother. Chhathi is celebrated on the sixth day, involving bathing the mother and child, dressing them in new clothes, paying obeisance to the sun, earth, family gods, and ancestors, followed by a feast for relatives.",
        "The marriage age for boys is considered to be 14-18 years, and for girls, it's around 12-16 years. Marriage proposals come from the groom's side, and the groom's father provides money, turmeric, oil, jaggery, etc., to the bride's father as \"Lagan Bharna.\" Marriages are solemnized by elders, and now Brahmins are also involved in the process. Remarriage, brother-in-law-sister-in-law marriage, and widow remarriage are accepted.",
        "In the event of death, the dead body is burnt, and the ashes are immersed in a nearby river. On the 10th day, after bathing, ancestors are worshiped, and a feast is organized. A traditional caste panchayat, headed by the \"Mukhiya,\" settles disputes related to Lagan filling, marriage, and other societal matters.",
        "Cultural practices of the Biar tribe include marriage dances during weddings and Rahas dances during Holi. Folk songs, including marriage songs and Phag Bhajans, are important. Folk tales, narrated during Karma, play a role in passing down traditions orally to the next generation.",
        "The main deities of the Biar tribe include Mahadev, Mother Earth, Simada, Duladev, Shitala Mata, Jwalamukhi, Bhaisasur, along with Hindu gods and goddesses. They celebrate festivals like Dussehra, Diwali, Navratri, Sankranti, Holi, worshipping gods and goddesses. Traditional wedding dances and Rahas dances remain prevalent in their cultural practices. Folk songs continue to be an essential part of their cultural expression, encompassing marriage songs, phagas, bhajans, etc.",
        
        "BINJHWAR",
        "The Binjhwar tribe, listed as number 11 among the Scheduled Tribes of Madhya Pradesh, is considered a minority tribe in undivided Madhya Pradesh. Presently, their population in Madhya Pradesh is estimated at 15,805 according to the 2011 Census, constituting 0.22 percent of the state's total population. The Binjhwar tribe is primarily found in Raipur, Bilaspur, and Raigarh districts of Chhattisgarh. Census data also indicates their presence in various districts of Madhya Pradesh, including Gwalior, Tikamgarh, Sagar, Rewa, Shahdol, Ujjain, Shajapur, Dewas, Jhabua, Indore, East Nimar, Vidisha, Bhopal, Sehore, Raisen, Betul, Harda, Hoshangabad, Katni, Jabalpur, Dindori, Mandla, Chhindwara, Seoni, and Balaghat.",
        "The origin of the Binjhwar tribe lacks historical records, and according to legends, they believe their origin can be traced back to the Vindhyachal mountain. Some scholars consider them a land-owning group that separated from the Baiga tribe, engaging in permanent agriculture.",
        "Binjhwar tribe generally resides in villages alongside tribes like Kanwar, Savra, Gond, etc. Their houses are constructed with mud and wood, featuring a roof made of native tiles. These houses typically consist of 2-3 rooms, with walls painted with white or yellow mud. The floor is made of mud and is smeared with cow dung daily. The village houses various rooms for different purposes, including grain storage, mortar, pestle, earthen stove, utensils, and agricultural equipment.",
        "Daily oral hygiene involves brushing teeth with acacia and neem sticks, while daily bathing is a common practice. Women often braid their hair and have tattoos on their hands and feet. Adorning jewelry is a common practice for women, including items like Bichhiya, Santi in their toes, a girdle around their waist, Khinwa in their arms, and Phuli in their nose. In terms of clothing, men wear Pancha and Bandi, while women wear Lugda and Polka. The primary food items for the Binjhwar tribe include Kodo, rice, stale, page, seasonal vegetables, urad, tuvar, moong dal, and fruits. They also consume chicken, goat, and fish meat, and during festivals, they drink liquor made from Mahua. Men smoke beedis as a form of smoking.",
        "The economic life of the Binjhwar tribe is primarily based on agriculture, wild produce collection, and labor. They cultivate crops such as Kodo, paddy, tivda, urad, moong, pigeon pea, and sesame. Due to unirrigated land, production is limited. Wild produce collection includes items like tendu leaves, pickles, harra, gum, and honey, which are sold in the local market. While hunting used to be practiced occasionally in the past, it is restricted now. Fishing is done during the rainy season for personal consumption.",
        "The Binjhwar tribe is divided into four sub-castes: Bade Binjhwar, Songara, Birjia, and Binjhiya. These sub-castes are considered exogamous groups. The elder Binjwars were landlords and were highly esteemed. Songaras used to collect gold particles in the river, Birjias were involved in beaver farming, and Binjhiyas, considered the lowest, are said to be descendants of the Gond king. Sub-castes are further divided into gotras, such as Padki, Lohi, Baadh, Karhibaadh Dondka, Nag, Paddy, Amli, Sonwani, Sarai, Bhainsa, Bhaunra, Taad, Kamaliya, etc. The family structure is patriarchal, and the ancestral home is local.",
        "During pregnancy, there is no specific ritual in the Binjhwar tribe. The delivery is typically done at home by a local midwife. After childbirth, the child's \"Nara\" is cut with a punch or blade of Bharuva grass, and the Nara is buried in a pit in the house. The pregnant woman is fed laddus made of dry ginger, jaggery, celery, ghee, and pepper. Chhathi is celebrated on the sixth day, involving rituals like men getting their hair done by the barber. Relatives are given beedis and liquor. After bathing the mother and the children and dressing them in new clothes, darshan/prayer is offered to the family deities.",
        "The marriage age for boys is typically between 14-16 years. The marriage proposal is usually initiated by the groom's side. Various items like rice, pulses, jaggery, oil, turmeric, coconut, and some cash are given to the groom's father in the form of \"Suk Bharna.\" The marriage is completed in four rituals: Bhagani, Phaldan, Vihav, and Gauna. While earlier caste elders arranged marriage ceremonies, now the services of Brahmins are also utilized. Remarriage of son-in-law, widow, remarriage of brother-in-law and sister-in-law is recognized.",
        "For death rites, the Binjhwar tribe follows the practice of burying the dead body. On the third day, close relatives and",
        "men of the family get their beard, mustache, and head hair shaved. On the 10th day, Dashakaram work is performed, involving bathing, worship of ancestors, and a death feast.",
        "A traditional caste panchayat is found in the Binjhwar tribe, with the head being called \"Gotiya.\" Disputes related to marriage, divorce, immoral relations, etc., are settled through traditional methods like fines or banquets. As part of folk culture, the Binjhwar tribe engages in various dances, including Karma dance on Karma Puja, Rahas dance on Holi, Vihav dance, and women dance Phadki dance on Ramsatta Diwali. Folk songs, including Sua Geet, Dadriya, Karma, Vihav Geet, Ramdhuni, Phaag, etc., are sung during these dances, with musical instruments like dholak, thali, and others being used.",
        "Traditionally worshiped deities in the Binjhwar tribe include Thakur Dev, Budhadev, Ghatwalin, Dulhadev, Kariya, Ghuruva, Bhainsasur, Satbaheniya, Mata, and others. Additionally, they worship all the Gods and Goddesses of the Hindu religion. Cock and goat sacrifices are made to traditional gods and goddesses. The main festivals celebrated by the Binjhwar tribe include Hareli, Pola, Nawakhani, Dussehra, Diwali, Holi, and others. They believe in ghosts and witchcraft, with individuals knowledgeable in magic mantras being called \"Baiga\" and \"Jhakhar.\"",
        "In terms of dance, the Binjhwar tribe engages in Karma dance on Karma Puja, Rahas Vihav dance on Holi, and women dance Phadki dance on Diwali. Important folk songs in their cultural repertoire include Sua Geet, Dadriya, Karma, Phag, Vihav Geet, and more.",
        
        "BIRHOR",
        "The Birhor tribe, designated as number 12 in the Scheduled Tribe list of Madhya Pradesh, is a minority tribe known for residing in forested areas. The name \"Birhor\" is derived from \"Bir\" meaning forest and \"Hor\" meaning resident, collectively translating to \"resident of the forest.\" The majority of their population is concentrated in the hilly areas of Raigarh district in Chhattisgarh. Additionally, the Birhor tribe is found in the border areas of Bihar, West Bengal, and Orissa. According to the 2011 Census, their total population in Madhya Pradesh is estimated to be only 52, constituting 0.000 percent of the state's total population. Census data from 2001 and 2011 reveals the presence of the Birhor tribe in various districts of Madhya Pradesh, including Gwalior, Dewas, Indore, Rajgarh, Bhopal, Sehore, Raisen, and Jabalpur.",
        "The origin of the Birhor tribe lacks historical evidence, and it is considered a tribe of the Kolarian group. According to popular legend, the Birhor tribe traces its roots to a figure named Satbhai, who was dropped on Earth by Surya and came to this country from Khairagarh. The tribe's origin story involves brothers who went on a journey, with one eventually becoming associated with the forest and adopting the name \"Birhor.\"",
        "Birhor people typically do not establish villages. Instead, they construct their huts in open spaces outside the villages of other tribes. These clusters of huts are referred to as Kumbha or Padav, and the Birhor term for them is \"Tanda.\" These huts are usually made from the leaves of the Sal tree or other trees.",
        "The lifestyle of the Birhor tribe is characterized by simplicity. Birhor men wear a garment called \"Kopani,\" similar to a small dhoti, while women wear \"Lugda.\" Tattooing is a favorite hobby among the Birhor people, and they also adorn themselves with glass bangles, earrings, and rings. The primary foods in their diet include rice, Kodo leaves, urad dal, wild tubers, seasonal vegetables, and non-vegetarian items like chicken, goat, fish, crab, rabbit, deer, and forest birds. Additionally, they make Mahua liquor and consume it.",
        "Hunting of wild animals and rope-making are the primary occupations of the Birhor tribe. Their economy is closely tied to the forest, and daily activities involve venturing into the forest to collect food and materials. Notably, Mahua is a significant food item for the Birhor people. Women engage in collecting raw materials, especially flax for making ropes. They also participate in making nets, brooms, khappar, dona, mats, and baskets. The Birhor tribe displays unity and mutual support during challenging times.",
        "Birhors are divided into different gotras, and the names of their clans are based on natural objects. These clans live according to their respective social statuses. Marriage practices involve different types, including Biha, Udriya, and Churahiya. The age of marriage for boys is around 17-18 years, while girls are considered eligible for marriage between 12-16 years. Inter-marriage between Janghi Birhor and Uthlu Birhor is not allowed.",
        "The birth of a child in the Birhor tribe involves a unique process. Pregnant women give birth in the lap of nature under a tree in the forest, believing that nature witnesses the birth. The child's umbilical cord is cut with a bamboo splinter. The naming ceremony and tonsure ceremony take place on the sixth day, conducted by the elderly members of the family.",
        "The Birhor tribe has its own panchayat, and the head is referred to as \"Mukhiya.\" While decisions are generally made collectively, the final decision is accepted by the head Baiga and the priest Gunia.",
        "In terms of cultural practices, the Birhor tribe engages in dances such as Lubhari dance during Karma and Jeetiya festivals, Jarga dance on Fagua and Sarhul, and Sauhantari dance during other festivals. Men exchange leaves of Karamdal for friendship, while women sprinkle water on each other during river visits to symbolize friendship. The main deity worshiped by the Birhor tribe is Surya. Other deities include the old mother, dead mother, ancestors, mountains, and trees. Rituals involve offering liquor and sacrificing goats and cocks. Major festivals celebrated by the Birhor tribe include Nawakhani, Dussehra, Sarhul, Karama, Sohrai, and Fagua. They believe in ghosts, magic, and mantras, with knowledgeable individuals in these practices called \"Pahan.\"",
        "The Birhor tribe engages in various dances during their festivals, including Karma, Fagua, and Bihav dances. Their folk songs, such as Karmageet, Suageet, and Vihavgeet, are accompanied by musical instruments like Madal, Dhol, Dhafli, Timki, among others. The unique cultural practices and rituals of the Birhor tribe showcase a distinct way of life and a deep connection with nature and their forested surroundings.",
        
        "DAMOR",
        "The Damor tribe, designated as number 13 in the Scheduled Tribes list of Madhya Pradesh, is a minority tribe with a significant population also found in Rajasthan. According to the 2011 census in Madhya Pradesh, their total population is estimated at 1815, constituting 0.002 percent of the state's total population. The Damor tribe primarily resides in districts such as Jhabua, Ratlam, Dhar, and Mandsaur. Census data from 2001 and 2011 indicates their presence in various other districts of Madhya Pradesh, including Gwalior, Shivpuri, Guna, Panna, Sagar, Satna, Shahdol, Sidhi, Neemuch, Indore, Ujjain, Bhopal, Sehore, Raisen, Katni, Jabalpur, Mandla, Chhindwara, and others.",
        "The Damor tribe traces its origin to a legend involving two brothers, Lord Manji and Balaji Manji, who were descendants of a Parmar king. The brothers went hunting and encountered a hut owned by someone of the Dom caste. Lord Manji drank water from the hut, but Balaji Manji, upon learning the caste of the owner, refrained from doing so. Lord Manji felt ashamed and later went on to serve in the army of the king of Dungarpur, earning land and villages. The descendants of Lord Manji, because of drinking water from the Dom's house, came to be known as Damor.",
        "Damor tribe members typically live in villages alongside other tribes, although their houses are scattered. Most of their houses are kutcha (made of mud), with walls constructed from Tuvar mortar, wood, mud, and cow dung. The roof consists of wooden pillars with local clay tiles. Before constructing a house, a pillar is buried and worshipped. While traditional wooden and clay utensils were used, modern materials like aluminum, brass, and steel have become popular.",
        "Both men and women of the Damor tribe follow a daily routine that includes morning tooth brushing with acacia or neem sticks, bathing with black soil, and hair care. Women often adorn themselves with silver and gilt metal jewelry from head to nails, including items like Bor, Sikri, Jhumka, Kanta, Tagli, Galsad Bohta, Kadle, Payal, Bakla, Tuda, and Bisudi. Men wear earrings and bangles, with a turban forming part of their clothing. The traditional attire for men includes high dhoti, kurta, and a turban, while women wear choli, odhni, and ghagra.",
        "Tattooing is a practice among the Damor tribe, and their main food includes maize, jowar roti, urad dal, and seasonal vegetables. On festive occasions, they consume chicken, goat, and fish. Liquor made from Mahua is also part of their dietary habits.",
        "The economic life of the Damor tribe revolves around agriculture, labor, wild produce collection, and animal husbandry. They cultivate crops like maize, jowar, kodra, tuvar, and groundnut. Additionally, they collect forest products like Mahua, Gulli, gum, and honey. Some Damor tribe members are also involved in various businesses and government services.",
        "The Damor tribal society is patrilineal, patriarchal, and patrimonial. It is divided into two sub-castes: High Damor and Low Damor. These sub-castes do not intermarry but maintain a food-and-drink relationship. The Damor tribe is further divided into many clans and gotras, with some main clans including Damor, Parmar, Sisodia, Rathod, Chauhan, Solanki Baria, and others. Clans are exogamous groups, meaning individuals from the same clan do not marry each other.",
        "During pregnancy, there are no specific rituals observed in the Damor tribe. The delivery is conducted at home by elderly women and the village midwife. After delivery, a pit is dug in the house, and the umbilical cord is buried. Medicinal herbs are given to the pregnant woman, and rites take place on the seventh or ninth day after delivery.",
        "Marriage in the Damor tribe typically occurs at the age of 13-16 years for boys and 12-15 years for girls. Marriage proposals come from the groom's side, and the groom offers cash to the bride, known as \"Dapa.\" Various marriage methods, including exchange, service marriage, co-emigration, infiltration, and Natra marriage, are recognized by the society.",
        "After death, the Damor tribe practices cremation, and the ashes are immersed in a river. Purification rituals and a feast for caste people are held on the 13th day after death.",
        "The Damor tribe has its own traditional caste panchayat, with the head called \"Mukhi\" and other members acting as punches. The panchayat controls immoral relations within the caste, arranges worship of caste deities, and settles disputes related to marriage and divorce.",
        "Festivals and fairs hold special significance in Damor tribal culture. Diwasa, Rakhi, Nowai, Navratri, Dussehra, Deepawali, Bhagoria, among others, are celebrated with fervor. The Damor tribe engages in various dances during festivals, including Garbi, Lagan, Phaag, and others. Their main deities include Mahadev, Dakorji, Keshariji Kuverji, Kalka Mata, Pavagadh Wali Maa, Ambaji, Shitalamata, and others. Damor tribe members also believe in Damdena, ghosts, witchcraft, and have their unique set of folk songs accompanied by musical instruments such as Dhol, Mandal, Morli, and more.",
        
        "DHANWAR",
        "The Dhanwar tribe, designated as number 14 in the Scheduled Tribe list of Madhya Pradesh, primarily resides in the Chhattisgarh region, particularly in Bilaspur, Surguja, and Raigarh districts. According to the 2011 census, the Dhanwar tribe's total population in Madhya Pradesh is estimated at 2175, constituting 0.003 percent of the state's total population. They are also found in various districts of Madhya Pradesh, including Morena, Gwalior, Shivpuri, Chhatarpur, Sagar, Satna, Rewa, Shahdol, Sidhi, Neemuch, Ratlam, Ujjain, Dewas, Jhabua, Dhar, Indore, Barwani, West Nimar, Rajgarh, Vidisha, Bhopal, Sehore, Raisen, Betul, Hoshangabad, Jabalpur, Narsinghpur, Dindori, Mandla, Chhindwara, Seoni, Balaghat, and others.",
        "The origin of the Dhanwar tribe is not precisely documented, but according to legends, the term \"Dhanwar\" originated from the words 'bow' and 'arrow' used in ancient wars. The tribals who were involved in making bows and arrows started being referred to as \"Dhanwar.\"",
        "Dhanwar tribe members often live in villages alongside other tribes like Gond, Kanwar, and Saunta. They have their own locality known as Dhanwar Para, where houses are made of mud with grass and native tile roofs. The construction of a house involves a worship ceremony performed by the village priest. Dhanwar households typically have two rooms, and there is a separate area for tying animals. Their possessions include earthen pans, pots, scaffolding for water pitchers, Kothi for storing grain, and various household items.",
        "Men and women of the Dhanwar tribe follow a daily routine involving oral hygiene with acacia, neem, or hare sticks, bathing with black or yellow soil, and applying peanut or Gulli oil. Women wear Lugda and Polka, and men wear Pancha Bandi. Women often have tattoos on their hands and feet, wear bangles, Anthi in their hands, Sutiya Surra around their neck, Phuli in their nose, and earrings in their ears.",
        "The main food of the Dhanwar tribe includes Kodo, rice, stale page, seasonal vegetables, urad, moong, and gulthi dal. They also consume fish, chicken, goat meat, and liquor made from Mahua.",
        "The livelihood of the Dhanwar tribe is primarily dependent on agriculture, wild produce collection, and hunting. They cultivate crops such as paddy, Jowar, Kodo, Kutki, Urad, Maize, Linseed, and Tur. Additionally, they collect forest products like Mahua char, gum, tendu leaves, harra, and honey, which are sold.",
        "Dhanwar society is based on patrilineal patriarchy and ancestral local tradition, with divided families and many gotras. Some major gotras in the Dhanwar tribe include Rooms, Marai, Uike, Uren, among others. Inter-marriage within the same gotra is not permitted.",
        "In the context of childbirth, the birth of a boy or girl is considered auspicious. A knowledgeable woman from the village assists with childbirth, and rituals like Sata Puja are performed seven days after the birth.",
        "Marriage within the same gotra is not allowed in the Dhanwar tribe. The engagement ceremony involves the distribution of jaggery, and after engagement, the boy goes to the girl's house with offerings like rice, pulses, jaggery, oil, turmeric, cash, and clothes.",
        "In the case of death, the deceased is cremated, and a Dashakarma ritual is performed on the tenth day.",
        "The Dhanwar tribe has its caste panchayat, with a head called Ghania. The panchayat is responsible for arranging worship, settling disputes within the caste, and providing justice.",
        "The Dhanwar tribe engages in various traditional dances and songs, with both men and women dancing together. Musical instruments like Madal, Dholki, Thali are played during these performances. Festivals like Hareli, Pola, Pitar, Navakhani, Dussehra, Diwali, Holi, among others, are celebrated with traditional rituals, including animal sacrifices. The Dhanwar tribe also holds beliefs in ghosts and witchcraft.",
        "Young men and women of the Dhanwar tribe engage in singing Karmageet and dancing during Karma Puja. They perform dances such as Pali Khelna and Rahas during Holi, and Padki in Diwali. Other folk songs include Dadriya and Ramsatta.",
        
        "GADABA",
        "The Gadaba tribe, notified as number 15 in the Scheduled Tribe list of Madhya Pradesh, originally hails from Orissa and is currently found in the Bastar district of Chhattisgarh, particularly within a 20-kilometer radius from Jagdalpur tehsil. According to historical records, King Mahipal Dev Singh of Bastar brought them to Bastar from Orissa around 1470 to serve as palanquin bearers and for domestic work. The Gadaba tribe has since settled permanently in the region.",
        "As of the 2011 census, the total population of the Gadaba tribe in Madhya Pradesh is estimated at 578, constituting 0.001 percent of the state's total population. They are distributed across various districts in Madhya Pradesh, including Gwalior, Tikamgarh, Chhatarpur, Sagar, Damoh, Satna, Rewa, Umaria, Shahdol, Sidhi, Mandsaur, Ratlam, Ujjain, Shajapur, Dewas, Jhabua, Dhar, Indore, West Nimar, East Nimar, Bhopal, Raisen, Betul, Harda, Hoshangabad, Jabalpur, Mandla, Chhindwara, Balaghat, and others.",
        "The Gadaba tribe's origin can be traced back to Orissa, and they were initially brought to Bastar for specific purposes. Over time, their population increased, and those who migrated to Bastar did not return to their native state.",
        "In terms of habitat, Gadaba tribe members live in villages alongside other tribes in Bastar. Their houses are hut-like structures made of thatched grass and tiles, each with a courtyard. Households possess earthen pots for storing grains, clothes for covering, utensils for preparing food, agricultural equipment, threshing floor, spade, hoe, pickaxe, fishing nets, and more.",
        "Gadaba men keep their hair short, while women comb their hair and often have tattoos on their hands and feet. Women wear aluminum jewelry called Gilat, and men wear traditional attire such as dhoti, gamchha, saluka, kameez, and bandi, while women wear saree, lugda, and polka.",
        "Their main food includes rice, Kodo, Kutki rice, and Paige. Additionally, they consume gram, pigeon pea, urad, lentils, seasonal vegetables, and non-vegetarian items like fish, goat meat, chicken, along with Mahua liquor.",
        "The economic life of the Gadaba tribe is centered around agriculture, labor, food collection, and wild produce. They cultivate crops like paddy, maize, sesame, urad, kodo, and jowar. Those without land work as laborers on other fields. They also collect forest produce such as Mahua, bamboo root, Boda Kanda, gum, tendu leaves, and cocoons.",
        "Gadaba society is patrilineal and divided into different gotras, including Kukarvansh, Nagpus, and Kuraiya. Marriages are exogamous, meaning they do not take place within the same Gotra.",
        "There are no specific rituals observed during pregnancy among the Gadaba tribe. During childbirth, a mature woman assists, and after delivery, the umbilical cord is cut, and a pit is dug to bury it. The naming ceremony takes place on the ninth day.",
        "Marriage is a significant rite of passage in Gadaba culture. It is usually arranged by parents, with little importance given to the preferences of the boy and girl. Widow remarriage is also prevalent. After death, the deceased is buried, and a feast is organized after nine days.",
        "The Gadaba tribe has its traditional caste panchayat, led by an elderly person of the caste. The panchayat resolves matters related to marriage, divorce, inheritance, partition, immoral relations, and more.",
        "Cockfighting is a prominent hobby among the Gadaba tribe, celebrated in Poos, where families bring their chickens, and the winner receives a reward. Parva Churai is celebrated during Diwali, where families give gifts to those who graze cattle throughout the year.",
        "The Gadaba tribe holds strong beliefs in religion, worshiping local deities such as Dharani Devi and Rasdevi. They also have separate festivals like Omush, Dhanwa, Amanva, and believe in witchcraft and ghosts.",
        "Folk dances, wedding dance, Holi dance, wedding songs, Holi songs, and Mata songs are prevalent among the Gadaba tribe. Cockfighting is a notable hobby celebrated in June, and Parva Churai is a festive event during Diwali, marked by dancing and singing.",
        
        "GOND",
        "The Gond tribe, the 16th scheduled tribe in Madhya Pradesh, holds a significant place in the state's demographics. According to the 2011 census, the Gond tribe's total population in Madhya Pradesh is estimated at 5,093,124, constituting 7.013 percent of the state's total population. The Gond tribe primarily resides in the Vindhya, Satpura regions, and along the banks of the Narmada River in Madhya Pradesh. The districts where they are predominantly found include Mandla, Dindori, Balaghat, Shahdol, Umaria, Chhindwara, Seoni, Betul, Jabalpur, Hoshangabad, Harda, Raisen, Sidhi, Panna, Sagar, Damoh, Satna, Khandwa, Sehore, Narsinghpur, Neemuch, Mandsaur, Ratlam, Ujjain, Shajapur, Dewas, Jhabua, Dhar, Indore, West Nimar, Barwani, East Nimar, Rajgarh, Vidisha, Bhopal, Sehore, Raisen, Betul, Harda, Hoshgabad, Katni, Jabalpur, Narsinghpur, Dindori, Mandla, and Chhindwara.",
        "The Gond tribe is not limited to Madhya Pradesh; they can also be found in other states such as Maharashtra, Andhra Pradesh, Bihar, Orissa, Karnataka, West Bengal, Gujarat, and Uttar Pradesh. The Gond tribe has a historical significance in Madhya Pradesh, particularly in the Gondwana region, where they have ruled. One notable figure is Veerangana Rani Durgavati, a famous Gond ruler whose domain extended to Jabalpur, Katni, Balaghat, Mandla, and Dindori in Mahakaushal.",
        "Various myths and legends surround the origin of the Gond tribe. One hypothesis suggests their migration along the western sea routes of India along with Aryans and Dravidians. The term \"Gond\" is believed to be derived from the Telugu (Dravidian) word \"Konda,\" meaning mountains, indicating that the Gonds were people who lived in mountainous regions. Another hypothesis links the word \"Gond\" to the term \"Gondh\" used for people in the Bihar and West Bengal region.",
        "The Gond tribe traditionally builds their homes in forests, mountains, on riverbanks, or in valleys. They construct houses with the help of their families, performing ritual worship of the place, and the foundation is often laid on Sundays, Thursdays, or Fridays. Typically, their houses have one or two rooms with roofs made of grass and native tiles. The walls are plastered with cow dung soil and painted with white or yellow soil. Decorative paintings reflecting aspects of their life are often visible on the walls and doors.",
        "The Gond people have distinct traditional attire and jewelry. Women get tattoos on their hands, feet, and face. Their main ornaments include Paadi on the feet, foot bandage, girdle on the waist, bangles, aithi, kakna, guletha, surda, khinwa, and more. Most jewelry is made of silver or gilt. Men wear silver bangles, mohar around their neck, and Bunda in their ears. Gond people have a penchant for colorful clothes, and traditional attire is often worn for both decoration and protection. With the spread of education and urban civilization, there is an increasing interest in modern clothes among the youth.",
        "The primary occupation of the Gond tribe has historically been primitive agriculture and the collection of forest produce. Various sub-castes within the tribe engage in activities such as exorcism, dancing, and tattooing. Gonds are known to graze cattle, and different sub-castes have specialized roles, including musicians (Nagarchi). Their main food includes rice, pulses, kodon, kutki rice, paige, wheat, jowar, millet bread, Mahua fruits, and Gulli oil. The Gond tribe's agricultural practices are heavily dependent on monsoon rainfall, as their land is unirrigated.",
        "The Gond tribe follows a patriarchal social structure and is divided into numerous sub-castes based on habitat area and nature of work. Some of these sub-castes include Mandla (associated with Zamindari), Rajgond (Dindori), Agariya (iron smelters), Dhoba, Dulia (dancers and singers), Ojha (Mogiya Gond - involved in mantra and tattooing), Bhimma (singers), and more.",
        "The Gond tribe practices endogamous marriages, and there is a tradition of bride price. Marital relationships between maternal uncles and aunts are also common. The age of marriage for girls is typically 12-16 years, and for boys, it is 14-18 years. The marriage proposal usually originates from the groom's side, and various rituals, including betrothal, phaldan, laguna, and others, are performed. The Gond tribe has specific ceremonies like Chad marriage, Lamsena marriage, migration marriage, and widow marriage (wearing bangles).",
        "The Gond tribe observes specific death rituals, and reincarnation is not a widely held belief. Rituals are performed for the deceased, indicating a belief in rebirth. The Gonds have concepts of heaven, hell, and karma consequences, albeit weaker. They believe in ghosts (Devayoni) based on the deeds of the deceased in their previous birth. The dead body is kept at a resting place on the way to the cremation site, and specific rituals are conducted to prevent the soul from returning home.",
        "The Gond tribe has a traditional caste panchayat, led by the village Patel and other Panchs. The panchayat's responsibilities include collecting donations for worship, arranging expenses for festivals, settling disputes, punishing wrongdoers, controlling immoral conduct, and overseeing matters related to marriage and divorce. Punishments may include cash fines, group dinners, or a combination of both. There are also penal laws regarding communal feasts as atonement for outcasts to rejoin the caste.",
        "The Gond tribe is known for its cultural specialties, and they perform various dances and songs during festivals. Folk songs like Karma, Dadriya, Shailageet, Suageet, Faggeet, Diwaligeet, and Vivahgeet are prevalent, and both men and women actively participate. Musical instruments like Madal, Timki, Manjira, Khartal, Chutki, and Jhanj are used. Festivals play a crucial role in Gond culture, with celebrations like Hareli, Pola, Nawakhani, Dussehra, Diwali, Jawara, and others being observed with great enthusiasm.",
        "While the Gond tribe does not follow a specific religion, they have strong beliefs in their traditional gods and goddesses. In times of distress, various gods and goddesses are ritually worshiped. Gonds exhibit a deep connection to nature and have a rich mythology, with main deities including Badadev (god of creation and destruction), Narayan Dev, Dhamsen Dev, Muthiya Dev, Thakur Dev Khermai (village protector), Banjarin Mai, Budhi Mai (protector from smallpox), Sheetala Mai, Sharda Mai, Bhairodev, Dulha Dev, Jogni Gai, Kankalin Mai, and more. Festivals like Jiroti, Vidari Puja, Holi, Diwali, Navakhani, Jawara, Pola, and Bhujaliya are celebrated with traditional rituals and fervor.",
        "In terms of language, the Gond tribe has its own distinct dialect called \"Gondi.\" Overall, the Gond tribe in Madhya Pradesh maintains a unique cultural identity with rich traditions, rituals, and beliefs that reflect their historical significance in the region.",
        
        "HALBA",
        "The Halba tribe, a significant tribal community in undivided Madhya Pradesh, holds its cultural roots and distinct identity. According to the 2011 census, the total population of the Halba tribe in Madhya Pradesh is estimated at 14,438, constituting 0.020 percent of the state's total population. This tribe primarily resides in the districts of Bastar, Durg, Raipur, Rajnandgaon, as well as minority populations in Balaghat, Seoni, Chhindwara, and other areas.",
        "The origin of the Halba tribe is surrounded by legends and conceptual narratives. Some scholars suggest that the name \"Halba\" is derived from \"Hal\" meaning plow, indicating their expertise in agriculture. According to a legend related to the Mahabharata period, the Halba tribe's origin is linked to the incident of Rukmani Haran. Balram's intervention during the kidnapping led the soldiers involved to adopt agricultural tools like the plow and pestle, and the tribe became known as Halba, meaning plow bearers.",
        "Halba villages are organized into localities called Paros, with rectangular or circular shapes. The houses are typically mud structures with roofs made of tiles or native Kavelu. Halba villages coexist with other tribes like Gond, Bhatra, and Muria. The Halba women are meticulous about house cleanliness, and tattooing on hands and feet is a common practice. Men wear traditional attire like dhoti, patka, bandi, saluka, while women wear sarees and blouses. The main food consists of rice, kodo, kutki ka bhaat, along with pulses, vegetables, and meat. Festivals and rituals involve the consumption of toddy and Mahua liquor after offering it to Gods and Goddesses.",
        "The Halba tribe's economy is primarily agriculture-dependent, and they cultivate crops like kodo, arhar, urad, moong, tili, chana, tivda, kutki, and others. Additionally, they engage in the production of pounded rice (chivda). The tribe has divisions into three main parts: Bastaria Halba, Chhattisgarhia Halba, and Marethiya Halba, with subdivisions of Purat and Surat. The Halba tribe is further divided into various Gotras, and Gotra exogamy is observed in marriage customs.",
        "In terms of marriage rituals, the Halba tribe practices arranged marriages, with no dowry system. Marriages between people of the same Gotra are prohibited. The tribe follows specific rituals during pregnancy, childbirth, and naming ceremonies. After childbirth, there is a purification ceremony, and the child's hair is tonsured. Death rituals involve cremation, and the third, tenth, and thirteenth days after death have specific observances.",
        "Traditional political organizations, such as Garhs and Panchayats, handle social justice systems and dispute resolution. The Halba tribe participates in various cultural practices, including folk dances, songs, bhajans, and dramas. Karma dance, Rahas or Ramsata dance, and Ramlila drama are notable performances. The tribe has great faith in Hindu gods and goddesses, celebrating festivals like Pola, Hareli, Navakhani, Rakshabandhan, Diwali, and more.",
        "The main deities worshiped by the Halba tribe include Gram Dev, Kul Dev, Dulha Dev, Thakur Dev, Dhurva (Karia) Mata, Devala, Kankalin Mata, Lord Shankar, Hanuman, and others. Fasts and festivals, like Ekadashi, Mahashivratri, Pola, Hareli, Navakhani, Rakshabandhan, Diwali, Bijja, Madai, Dussehra, and Holi, are observed with enthusiasm.",
        "Halba tribe has its own folk songs, dances, and traditions, preserving their cultural identity amidst societal changes. The community maintains its unique customs and beliefs, emphasizing social cohesion and the celebration of life events.",
        
        "KAMAR",
        "The Kamar tribe, primarily residing in Gariaband, Chhura Mainpur, and Nagari development blocks of Raipur district, now part of Chhattisgarh, has been designated as a special backward tribe by the Government of India. According to the 2011 census, their total population is estimated at 666, constituting 0.001 percent of Chhattisgarh's total population. In Madhya Pradesh, the Kamar tribe is found in various districts, including Shivpuri, Gwalior, Guna, Tikamgarh, Chhatarpur, Sagar, Satna, Umaria, Shahdol, Sidhi, Neemuch, Mandsaur, Ratlam, Shajapur, Dewas, Indore, and many others.",
        "The Kamar tribe traces its origin to Devdongar village in the Mainpur development block, with its primary deity being Bamandev, installed in \"Bamandongri\" of Devdongar.",
        "The houses of the Kamar tribe are constructed using thatch, wood, and mud, with doors made of wood or bamboo. The roof is made of grass and tiles, and white mud is used to paint the walls. Daily life involves basic necessities like mills, granaries, bamboo baskets, mats, earthen pots, pestles, and farming implements. Both men and women follow hygiene practices, including daily teeth brushing and bathing.",
        "In terms of clothing, men wear Pancha (small dhoti), Bandi, Saluka, while women wear Langra Polka. Adornments like imitation silver jewelry are also part of their attire.",
        "The main food of the Kamar tribe includes rice, kodo page, moong, urad, tuvar dal, seasonal vegetables, and non-vegetarian items such as rabbit, chicken, bird meat, and fish. Mahuva liquor is prepared and consumed by men, along with smoking beedis and using chongi.",
        "The Kamar tribe is engaged in various occupations such as making and selling bamboo soup, hunting, fishing for personal consumption, primitive agriculture, and collecting forest produce like Mahua, Tendu leaves, Salbeej, Bamboo, Chironji, Gum, and Amla, which are sold for purchasing other essential commodities.",
        "The tribe is divided into two groups: Pahar Patiya and Bundarjeevi, residing in mountainous and plain areas, respectively. Gotras like Jagat, Netam, Markam, Seedi, Murai, Chediha, and Kunjam are prevalent. Marriage within the same Gotra is prohibited. The Kamar tribe has central families that are patrilineal and patriarchal, with ancestral homes localized.",
        "During pregnancy, there are no specific rituals, and deliveries take place at home. After birth, rituals involve bathing the mother and newborn with warm water, applying oil and turmeric, and celebrating with the family.",
        "Marriage age for boys is generally 18-19 years and for girls, 16-17 years. The groom's side gives rice, pulses, and cash as bride wealth. Marriage rituals are supervised by elders, and apart from regular marriages, home marriages and widow remarriages are accepted. After death, the body is buried, and rituals like Teej Nahavan on the third day and a funeral feast on the thirteenth day are observed.",
        "A caste panchayat handles social issues, and disputes are generally settled at the village level. Regional caste panchayats are organized for larger matters, especially during festivals, fairs, and public events.",
        "The Kamar tribe engages in traditional dances during festivals. Sua dance is performed by women during Diwali, and both men and women dance together at marriages. Traditional dances are also performed by men during Holi and Diwali.",
        "The main deities worshipped by the Kamar tribe include Rachna, Dhurva, Budhadev, Thakurdev, Dulhadev, Badi Mata, Majhli Mata, Chhoti Mata, Budhi Mai, Dharti Mata, Pogri deity, Mangar Mati, and Gatadooma. They celebrate festivals like Hareli, Pora, Navakhai, Dussehra, Chherchera, Holi, and others. The Kamar tribe also holds beliefs in ghosts, magic, and practices related to Tantra-Mantra, with individuals knowledgeable in these matters being called Baiga.",
       
        "KANWAR",
        "The Kanwar tribe, a significant community in undivided Madhya Pradesh, has a total population of 18,603 in Madhya Pradesh, constituting 0.026 percent of the state's total population, according to the 2011 census. They are primarily found in Bilaspur, Raigarh, Surguja, Raipur, Durg, and Rajnandgaon of Chhattisgarh, areas that were once part of Madhya Pradesh. The highest number of settlements is in Bilaspur division, with populations in districts such as Shahdol, Anuppur, and others.",
        "Legend traces the origin of the Kanwar tribe to the Kaurava dynasty king Duryodhana of the Mahabharata. According to the myth, the surviving Kauravas, after the Kurukshetra battle, hid in the forests, eventually becoming known as Kanwar or Kuruvanshi.",
        "The Kanwar tribe resides in villages alongside other tribes like Gond, Oraon, Binjwar, Bhaina, Nagesia, etc. Their houses are constructed with mud, featuring roofs made of native tiles or grass. Typically, a house has multiple rooms, including a kitchen, worship area, storage for paddy (khodiya or kothi), and a separate room for animals. The walls are painted with white or yellow clay.",
        "In terms of clothing, men wear knee-length dhotis and shirts, while women wear cotton sarees, polkas, and young girls wear lehengas and blouses. Adornments like Mudri, bangles, anthi, nagmori, paanuchi, and various jewelry pieces are worn by both men and women. Women often have tattoos on their hands, legs, and arms.",
        "The main food of the Kanwar tribe includes rice, Kodo rice, stale page, urad, arhar dal, and seasonal vegetables. They also consume meat from sources like chicken, goat, and rabbit. Mahua liquor is consumed during festive and special occasions.",
        "The primary occupation of the Kanwar tribe is agriculture, cultivating crops like paddy, kodo, sesame, tivara, moong, urad, among others. Landless or less agricultural families may work as laborers in other fields. Additionally, they earn income by collecting forest produce like Mahua, Tendu leaves, Mahul leaves, pickle gum, Harra, etc.",
        "The Kanwar tribe follows a patrilineal, patriarchal, and patrilocal residence system. They are divided into various endogamous sub-castes, including Tanwar or Chhattri, Rathiya, Pankra, Cherwa, Dudhkanwar, etc. Some sub-castes, like Tanwar, have had zamindaris in Bilaspur district.",
        "Marriage within the Kanwar tribe is typically initiated by the groom's side, and the decision depends on the bride's family. The marriage process involves matchmaking, doormanga, breaking of bread, marriage, and Gauna. Suka Bharna involves the groom's side giving rice, pulses, oil, jaggery, turmeric, and cash to the bride's side. Widow remarriage is permitted, and after death, both burial and cremation practices are observed.",
        "The Kanwar tribe has its traditional caste panchayat, headed by a \"Gotiya.\" In addition to the village panchayat, there are Chak Panchayats and Satradiya Panchayats, which hold authority over multiple villages. These panchayats settle disputes related to marriage, immoral relations, and social rules.",
        "Festivals and cultural practices play a vital role in the Kanwar tribe's social life. Traditional collective folk dances and folk songs are integral, and festivals like Gherta or Chher Ghera, Til Sanskriti, Holi, Hareli, Karma, Navakhai, Sohrai, etc., are celebrated with enthusiasm. The main deities include Dulhadev, Bahandev, Thakurdev, Shikar Dev, Sarvamangaladevi, Sagai Devi, Budhwa, Rakshadevi, Matin Devi, Banjari Devi, among others. Sacrifices of goats or cocks are made during worship.",
        "Beliefs in ghosts, witchcraft, and practices related to tantra-mantra exist within the Kanwar tribe. Dance forms like Karmanritya, Suananach, Bhojali dance, Ramsatta, Suageet, Mojligeet, Phag, Devi Sevageet, etc., are popular among them. An expert in tantra-mantra and a priest of village deities is referred to as \"Baiga.\"",
        
        "KHAIRWAR",
        "The Khairwar tribe, a minority group in Madhya Pradesh, has a significant population in the state of Bihar, with smaller communities in Orissa, West Bengal, and Uttar Pradesh. In Madhya Pradesh, their total population, as per the 2011 census, is estimated at 76,097, constituting 0.105 percent of the state's total population. They predominantly reside in districts such as Sidhi, Shahdol, Panna, Chhatarpur, and others.",
        "The origin of the Khairwar tribe lacks historical evidence. According to Colonel Dalton, the term \"Khairwar\" is derived from the Khair tree, suggesting a connection to the Gond caste involved in making catechu from the Khair tree. Russell theorizes that Khairwars of Chhota Nagpur may have originated from Chero and Santhal communities who also engaged in catechu production. Some Khairwars trace their origin to Rohitashva, son of Maharaj Harishchandra of Suryavansh, while others connect themselves to a place called Khairagarh in Chhattisgarh.",
        "Khairwar villages are often situated amidst forests and valleys. Their houses, typically having one or two rooms, are constructed by the residents using clay, thatch made of grass, and native tiles. The walls are painted with white or yellow mud, and the floor is made of mud, covered with cow dung by women. In terms of clothing, men wear pancha dhoti and bandi on top, while women wear lugda and polka. Both men and women adorn themselves with jewelry, and women, in particular, get tattoos on hands, feet, and face.",
        "The primary food of the Khairwar tribe includes wheat, jowar roti, moong, urad, toor dal, seasonal vegetables, and non-vegetarian options like goat, chicken, fish, pheasant, and rabbit meat. They also consume liquor made from Mahua.",
        "Traditionally, the economic life of the Khairwar tribe relied on making catechu from the Khair tree, collecting wild produce, and engaging in agriculture. The process of making catechu involved cutting wood from the Khair tree, boiling it in water, and drying it. Presently, the catechu-making work has significantly reduced. Among wild produce, Mahua, Gulli, Harra, Amla, etc., are collected and sold. Those with agricultural land cultivate crops like paddy, coconut, maize, moong, urad, while those without land work as laborers in other farmers' fields.",
        "The Khairwar tribe follows a patrilineal, patriarchal, and patrilocal residence system. It is divided into exogamous sub-castes, with Surajvanshi, Daulatvanshi, Patvanghi, and Khairchura being the main sub-castes. The Surajvanshi sub-caste considers itself superior, wears the sacred thread, and claims connections to landlords.",
        "The birth of a child is considered a gift from God, and there are no specific rituals during pregnancy. Delivery is conducted by local midwives or elderly women, and after delivery, a decoction of jaggery, turmeric, gum, dry ginger is given. Naming is done by the elders of the family.",
        "Marriage for Khairwar boys is generally between 14-18 years, and for girls, it's between 12-16 years. The proposal is made by the groom's side, with the groom's father providing rice, pulses, jaggery, oil, and some cash to the bride's father. Clothes are given to the bride's mother. The marriage ceremony is performed by an elder of the caste. Services, infiltration, widowhood, divorce, and remarriage are recognized by society.",
        "The dead are typically buried, but some people opt for cremation. On the third day after death, men in the family get their beard, mustache, and hair cut. On the 10th day, a feast is served to community members.",
        "The Khairwar tribe has its traditional caste panchayat, led by a \"Mahto Majhi.\" Their posts are hereditary, and the panchayat settles matters like marriage, divorce, inter-caste marriage, property division, etc.",
        "The Khairwar tribe celebrates festivals like Karma Norta, Nabakhai, Dussehra, Holi, Vaishakhi, with Karma dance, Jadoora dance, Danda dance, and Vivah dance being integral to their cultural expression. They worship gods and goddesses and engage in rituals and sacrifices during festive occasions.",
        "Beliefs in religion and magic are strong among the Khairwar tribe. Their main deities include Thakur Dev, Maharani Devi, Budhimai, Satidevi, Bajarin Devi, Khunt Dev, Gurmadev, Dulhadev, among others. Major festivals involve worship, sacrifices of cocks and goats, and belief in ghosts, witchcraft, and tantra-mantra.",
        "Dance and music are prevalent in Khairwar tribe culture. They perform Karma dance, Jadoora dance, Danda dance, Vivah dance, using instruments like Mandar, Manjira, Dhol, Flute. Folk stories are also popular among them.",
        
        "KHARIA",
        "The Kharia tribe, residing mainly in Bihar, Orissa, and Chhattisgarh, also has a minority population in Madhya Pradesh. In M.P., their population, as per the 2011 census, is estimated at 2,429, making up 0.003 percent of the state's total population. They are found in various districts of Madhya Pradesh, including Morena, Gwalior, Datia, Shivpuri, Guna, Sagar, Damoh, Satna, Rewa, Shahdol, Sidhi, Neemuch, Mandsaur, Ujjain, Dewas, Jhabua, Dhar, Indore, West Nimar, East Nimar, Vidisha, Bhopal, Sehore, Raisen, Betul, Hoshgabad, Jabalpur, Narsinghpur, Mandla, Chhindwara, Seoni, Balaghat.",
        "The historical records about the origin of the Kharia tribe are not available. According to some legends, the ancestors of the Kharia tribe and the Nagvanshi Munda kings of Chhota Nagpur were initially real brothers. The younger brother was chosen as the king by the people of Chhota Nagpur, and the elder brother, as per tradition, took up the task of plowing fields. Some sources suggest that Kharia is a tribe of the Kolarian group and might be a group left behind in development from the Munda tribe.",
        "Kharia tribe lives in villages alongside other tribes like Kondh, Oraon, Munda, Nagesia, and Gond. Their houses are constructed with mud, featuring a roof made of grass and country tiles. The floor is made of mud and covered with cow dung. Household items include granaries, clothes, clay, aluminum, brass utensils, pestles, grain grinding mills, agricultural equipment, bamboo baskets, and jhuva (a local alcoholic beverage). In terms of clothing, men wear knee-length pancha and bandi, while women wear lugda polka. Women adorn themselves with tattoos, bangles, a Surda rupayamala around the neck, phuli in the nose, and khinwa in the ears.",
        "The primary food of the Kharia tribe includes rice, cooked rice, urad, moong, tuvar dal, seasonal greens, vegetables, wild roots, and non-vegetarian options like fish, goat, chicken, and rabbit. They consume liquor made from Mahua and Hadiya made from rice. Men in the tribe often smoke beedis.",
        "The Kharia tribe traditionally relied on food collection, wild produce collection, agriculture, and rope making for their livelihood. Some Kharias are still dependent on food and wild produce collection, while others have adopted permanent agriculture and labor as their main means of livelihood.",
        "The Kharia tribe follows a patrilineal and patrilocal residence system. Different subcastes, including Hill Kharia, Dholki Kharia, Dudhkharia, Munda Kharia, Bairaga Kharia, Durega Kharia, are found in different areas. The subcastes are further divided into various exogamous gotras.",
        "During pregnancy, there are no special rituals in the Kharia tribe. The delivery is conducted by local midwives or elderly knowledgeable women of the family. The age for marriage is generally considered to be between 13-18 for boys and 13-16 for girls. Marriage rituals are performed under the supervision of elders and knowledgeable people of the caste. Infiltration, co-migration, service marriage, and widow remarriage are also practices within this tribe. After death, the deceased is typically buried, and rituals involving cleaning, shaving, and bathing are performed. Dashakaram is performed on the tenth day, and a funeral feast is given to worship ancestors.",
        "The Kharia tribe has traditional caste panchayats, with the head called \"Pardhan.\" These panchayats settle cases related to immoral relations, marriage, divorce, bride price, and impose fines at social dinners.",
        "In the cultural aspect, major folk dances like Sarhul dance, Karma dance, Phag dance, and marriage dance are prevalent among the Kharia tribe. Their folk songs include wedding songs, Sarhul songs, Karma songs, Phag Bhajan, and bhajans, sung during various festivals and celebrations. Instruments like Timki, Dholak are used.",
        "The Kharia tribe traditionally worships deities like Dharam Devta, village Gods, Mother Earth, trees, plants, mountains, and snakes. Sacrifices of goats and cocks, along with offering liquor, are common in their worship. The priest knowledgeable about magic and tantra-mantra is called \"Pahan.\" Major festivals celebrated by them include Sarhul, Karma, Sohrai, Fagua, Nawakhani, and Dussehra.",
        "The main folk dances of the Kharia tribe are Sarhul, Karma, Fagua, and marriage dance, with major folk songs including Vivah Geet, Sarhul Geet, Karam Geet, Phag Bhajan, and others.",
        
        "KONDH",
        "The Kondh tribe, primarily located in Orissa and Andhra Pradesh, had a small presence in undivided Madhya Pradesh, particularly in Raipur and Raigarh districts. According to the 1981 census, their population in Madhya Pradesh in 1970 was 1,670. However, as of the 2011 census, their estimated population in the state is only 109, constituting 0.000 percent of the total population. They are notified as Scheduled Tribe number 23 for the entire state of Madhya Pradesh. The Kondh tribe is also known as Khond Kandh and Kondhiya.",
        "The origin of the Kondh tribe is not well-documented, but the term \"Kondh\" is derived from \"Kond,\" meaning mountain, suggesting a connection to people living in mountainous regions. They have their own dialect called Kondhi (Kui).",
        "In Madhya Pradesh, the Kondh tribe resides in villages along with other tribes like Sabra, Kanwar, Bijhanwar, and Gond. Their houses are typically constructed with mud, featuring roofs made of grass or country tiles. These houses generally consist of two rooms. Household items include granaries, pestles for threshing paddy, grain grinding mills, stoves, clay and aluminum utensils, agricultural tools, musical instruments, and fishing nets. In terms of clothing, men wear small dhotis (fans) and bandis, while women wear lugdas and polkas. Women also get tattoos on their hands, feet, and forehead. In terms of jewelry, they wear items like khinwa and surda, usually made of gilt or imitation silver.",
        "The main food of the Kondh tribe includes rice, Kodo page, urad, moong dal, seasonal vegetables, tubers, and non-vegetarian options like fish, chicken, and goat. They consume liquor made from Mahua, and men in the tribe smoke beedis.",
        "Traditionally, the Kondh tribe engaged in farming (primitive agriculture), hunting, and food collection. Presently, they are involved in permanent agriculture, labor, and the collection of wild produce. Their main agricultural products include paddy, kodo, urad, moong, kulthi, and madiya. They also collect tendu leaves, gum, pickles, tendu mahua, harra, and other forest products.",
        "The Kondh tribe follows a patrilineal, patrilocal, and patriarchal system. Subgroups like Dogaria Kondh, Kuria Kondh, Penga Kondh, Jhuriya Kondh, Jamia Kondh, and Nanguli Kondh exist, further divided into exogamous lineage groups. The main gotras include Bachha, Chhatra, Hikoka, Konjaka, Kadam, Narasingha, and others. Marriages between boys and girls of the same gotra are avoided.",
        "Childbirth in the Kondh tribe usually occurs at home, facilitated by local midwives or elderly women. Naming ceremonies are conducted after six months. The marriage age for boys is typically 15-19 years, and for girls, it is 13-16 years. The groom's side initiates the marriage proposal, and bride price includes rice, pulses, oil, liquor, cash, goat, lugda, etc. Marriage rituals are supervised by elders. Co-elopement and infiltration are socially recognized practices, and widow remarriage is accepted.",
        "After death, the Kondh tribe either buries or burns the body. On the tenth day, relatives shave their head, beard, and mustache and perform a ritualistic bath. The deceased's soul is believed to scatter rice in front of a rooster at the crossroads. A chicken's pecking is considered the arrival of the soul, and a feast is given to relatives.",
        "The Kondh tribe has its traditional caste panchayat, headed by \"Gotiya.\" Cases related to immoral relations, marriage with individuals from other castes, divorce, bride price, marital disputes, and property division are settled in a traditional manner.",
        "Traditional folk dances like marriage dance, Jaga dance, and folk songs are prevalent among the Kondh tribe. Bhajans and Phaag are also sung during various occasions. The Kondh tribe worships deities like Bela or Burapenju and Tari Mata, along with Mother Earth, Shitala Mata, and other natural elements. Rivers, mountains, trees, and snakes are also considered divine. Major festivals include Dussehra, Aghan, Jatra, Chaitra Jatra, Diwali, and Holi. Ghosts and witchcraft play a significant role in their beliefs.",
        "The primary folk dances among the Kondh tribe are marriage dance, Holi dance, Jaaga dance, and folk songs like bhajans and Phaag are also sung on various occasions.",
        
        "KOL",
        "The Kol tribe, considered the third in order of supremacy among the tribes in India, holds a significant population in Madhya Pradesh. According to the 2011 census, their total population is estimated at 1,167,694, making up 1.608 percent of the state's total population. They are primarily concentrated in districts such as Rewa, Shahdol, Jabalpur, Damoh, and Satna. Notified as Scheduled Tribe number 25 for the entire state of Madhya Pradesh, the Kol tribe is found across various districts, including Sheopur, Morena, Bhind, Gwalior, Guna, Tikamgarh, Chhatarpur, Panna, Sagar, Damoh, Umaria, Shahdol, Sidhi, Neemuch, Mandsaur, Ratlam, Ujjain, Dewas, Jhabua, Dhar, Indore, Barwani, East Nimar, West Nimar, Rajgarh, Vidisha, Bhopal, Sehore, Raisen, Betul, Harda, Hoshangabad, Katni, Jabalpur, Narsinghpur, Dindori, Mandla, Chhindwara, Seoni, and Balaghat.",
        "The Kol tribe often lives in separate groups, constructing simple houses with bamboo and mud walls, tile roofs, and usually two or three rooms. The lifestyle is uncomplicated, with men wearing dhoti and shirts, and women wearing choli, ghagra, lugra, and odni. Jewelry, made of silver, gilt, and bronze, is a significant part of women's attire. The Kol tribe's main diet consists of corn, jowar, bajra, wheat roti, kodo, rice, gram, urad, tuvar dal, and seasonal vegetables. They also consume meat and fish, and during festivals, Mahua liquor and toddy are consumed. Smoking bidi, tobacco, and chillum is a common practice.",
        "The economy of the Kol tribe depends on agriculture, labor, and forest produce collection. Due to limited education, government service opportunities are limited, and most engage in agricultural labor. The Kol tribe is divided into two sub-castes: Gavathiya Kols in the Jabalpur division and Bhumiyas in the Rewa division. These sub-castes have several exogamous gotras, including Thakuria, Ratul, Barwar, Chero, Bargiya, Mawasi, Burn, Sotwani, Kumhariya, Kathariya, Bhuwar, Rankata, Karpatiya, Katoliya, Nabhuniya, Dahit, Ratua, etc. The tribe follows a patrilineal, patriarchal, and ancestrally local system.",
        "Childbirth is considered a gift from God, and delivery takes place at the husband's home with the assistance of a local midwife. Marriage within the same gotra and among relatives is avoided. The boy's family initiates the marriage proposal, and the marriage age is around 15 for girls and 17-18 for boys. The bride price system is prevalent, and the marriage ceremony involves specific rituals. The Kol tribe practices widow remarriage and burial for unmarried and underage individuals.",
        "The Kol tribe has its caste panchayat, headed by \"Gotiya,\" responsible for caste-related matters, resolving disputes, and maintaining social order. The tribe worships deities such as Dulhadev, Hardaul, Manshadev, Bheron, and Kali Devi, along with Hindu deities. Major festivals include Diwali, Dussehra, Rakshabandhan, Holi, Akhatij, Diwasa, Nagpanchami, where sacrifices, dances, and songs are performed. Believers in witchcraft, they seek treatment through tantra mantra.",
        "Known for their folk songs, the Kol tribe uses instruments like Dholak, Timki, Katwal, and Manjira. Dadar, Phag Bhajan, and other songs are sung during various occasions, showcasing the rich cultural environment of the tribe.",
        
        "KOLAM",
        "The Kolam tribe primarily resides in Maharashtra and Andhra Pradesh, with a smaller presence in Madhya Pradesh, particularly in the districts bordering Maharashtra and Andhra Pradesh. Historical records indicate that their population in Madhya Pradesh was estimated at 351 in 1971 and 304 in 1981. According to the 2011 census, their total population in Madhya Pradesh is only 224, with the majority residing in Shahdol district.",
        "The Kolam tribe, notified as Scheduled Tribe number 26 in the state of Madhya Pradesh, has been observed in districts such as Shahdol, Jabalpur, Rewa, Bhopal, Harda, and Satna. Their population in the remaining districts is considered negligible. It is noteworthy that their main population is in the state of Maharashtra.",
        "The origin of the Kolam tribe lacks historical evidence. Dr. T.K. Vaishnavs has provided a socio-cultural introduction based on the Kolam tribe in Maharashtra. Some accounts describe them as a sub-caste of the Gond tribe, while others liken them to the Toda caste of Nilgiris. The Kolams of Andhra consider themselves descendants of Hidimbi and Bhima from the Mahabharata.",
        "The Kolam tribe has its own dialect, known as \"Kolami,\" which belongs to the Dravidian group. They live in hamlets at a distance from the main village, surrounded by agricultural land. The houses are constructed with mud and bamboo, featuring one or two rooms and thatched roofs made of grass-thatch or local tiles.",
        "In terms of clothing, men wear dhoti, bandi, and fanta, while women wear saree, blouse, and various traditional jewelry made of fake silver, gilt, etc. Their main food includes jowar roti, urad, moong, tuvar, barvati dal, and seasonal vegetables. Non-vegetarian food, including fish, goat meat, chicken, and wild birds, is also part of their diet.",
        "Historically engaged in bamboo utensil making, primitive agriculture, hunting, and food gathering, the Kolam tribe is currently dependent on agriculture and labor. Some individuals pursue government services after acquiring education.",
        "The Kolam tribe follows a patrilineal, patriarchal, and patrilocal social structure, with various exogamous clans and gotras. The traditional practice of women living in separate huts during menstruation was prevalent in the past. Childbirth occurs at home with the assistance of a local midwife.",
        "Marriage practices involve the preference for maternal uncle or aunt's daughter, and the age of marriage is around 17-20 years for boys and 14-18 years for girls. The marriage proposal is initiated by the groom's side, and a bride price, including grains, goats, and cash, is given. The tribe practices various forms of marriages, including exchange marriage, service marriage, and widow remarriage.",
        "The Kolam tribe has its traditional caste panchayat, known as Panchamadal, headed by a Nayak. This panchayat deals with cases related to immoral relations, property disputes, marriage, bride price, divorce, abduction, co-elopement, infiltration marriage, witchcraft, and imposes fines and social feasts as penalties.",
        "Culturally, the Kolam tribe is known for their \"Dandori\" dance called Gusdi and Dimsa, performed during weddings and other celebrations. They worship deities such as Bhimdev, Pochmai, Marimai, Sitadevi, Lakshmi, and Indumaladevi, along with Hindu gods, trees, rivers, and mountains. The Kolam tribe celebrates various festivals, including Sati (Village Bandhoni), New Year (Korar), Urabhim Puja (Bumi), Diwali, Simga (Holi), and Muri. They have a strong belief in ghosts and witchcraft, and rituals involving the sacrifice of a hen are performed for disease curing. The main folk arts include folk dance, Dandori, Gusadi, and Dimsa, with women dancing at weddings and men playing musical instruments like Tapata and flute. Folk songs are sung during marriages, festivals, and dances.",
       
        "KORKU",
        "The Korku tribe, also known as Karku in some regions, predominantly resides in the foothills of the Vindhya and Satpura mountain ranges in areas adjacent to Maharashtra. Their main population centers in Madhya Pradesh include districts such as Khandwa, Betul, Hoshangabad, Dewas, Khargone, and Sehore. According to the 2011 census, their population in the state is 730,847, constituting 1.006 percent of the total population.",
        "In some districts like Raisen and Sehore, they are referred to as Karku. The Korku tribe is officially recognized in Madhya Pradesh as Scheduled Tribe number 27. The population of the Korku/Karku tribe is spread across various districts in Madhya Pradesh, including Morena, Bhind, Gwalior, Datia, Shivpuri, Guna, Tikamgarh, Chhatarpur, Sagar, Damoh, Satna, Rewa, Umaria, Shahdol, Sidhi, Neemuch, Mandsaur, Ratlam, Ujjain, Shajapur, Dewas, Jhabua, Dhar, Indore, West Nimar, Barwani, East Nimad, Rajgarh, Vidisha, Bhopal, Sehore, Raisen, Betul, Harda, Hoshangabad, Katni, Jabalpur, Narsinghpur, Mandla, Chhindwara, Seoni, and Balaghat.",
        "The origin of the Korku tribe lacks historical records, but according to their legend, they believe in their origin from Mahadev, who created their ancestors. The Korku tribe is considered an ancient tribe belonging to the Kolarian group.",
        "Their houses are often hut-like, featuring 2-3 rooms, a courtyard in front, and a yard at the back. The walls are made by pasting mud or cow dung on bamboo sticks. Men wear traditional attire like dhoti, pancha, bandi, kurta, and a cap or turban. Women wear Cotton Lugda, Polka, camisole, saree, petticoat, and blouse. Tattooing is a custom among women, especially on hands, feet, face, and forehead. Jewelry is typically made of cheap metals like silver, gilt, and german.",
        "The main source of income for most Korku families is agriculture, focusing on Kharif crops such as jowar, millet, kodon, kutki, and maize. They also collect and sell minor forest produce like Harra, Amla, pickle, gum, etc. In terms of food, their diet includes Kodon, Kutki, Rice Bhaat, Page, Maize, Jowar Roti, Urad, Moong, Barbati Dal, and seasonal vegetables. Non-vegetarian dishes include meat from chicken, goat, rabbit, wild birds, and fish. They consume self-made Mahua liquor during festivals and various social and religious ceremonies.",
        "The Korku tribe is divided into sub-castes like Mawasi, Bavaria, Ruma, Bondya, Korku, etc., and these sub-castes further have different gotras like Darpiya, Sheel, Kasra, Akhadi, Sakon, Bhawari, Kash, Panje, Warskar, etc.",
        "In terms of marriage customs, delivery usually occurs at home with the assistance of an elderly woman or midwife. The Korku tribe practices both exogamous and endogamous marriages, and they celebrate various rituals like Bhanwar, engagement, and wedding ceremonies. Co-emigration, widowhood, remarriage of abandoned women, and divorce are also prevalent.",
        "Upon death, some affluent families have adopted cremation rituals. The third day after a person's death is celebrated as 'Teesha,' during which relatives are invited, and a funeral feast is given.",
        "The Korku tribe follows its traditional caste panchayat system, led by a respected individual who settles disputes and oversees social works related to gods and goddesses. Those who do not follow the panchayat's decisions may face punishments in the form of feasts or fines.",
        "Their main deities include Mahadev, Muthuvadev, Dulhadev, Jogni, Kalhababa, Vadyadev, Hardulala, Maisasur, along with Hindu deities like Ram, Lakshman, Sita, Hanuman, and Durga. Festivals like Vidari, Nagpanchami, Pola, Teegya Nawarwani, Dussehra, Diwali, and Holi are celebrated with enthusiasm. The Korku tribe believes in ghosts and witchcraft, and rituals involving exorcism are performed by Bhumkar Padhihara.",
        "Their traditional dance songs include Phag-Dhadhar, wedding songs Susun-Gadli, Sevageet, and Bhajan, accompanied by musical instruments like Dhol, Manjira, and Dafli.",
        
        "KORWA",
        "The Korwa tribe, considered a minority tribe in undivided Madhya Pradesh, is now found in the state of Bihar. According to the 2011 census, their total population in present-day Madhya Pradesh is estimated to be only 920, making up 0.001 percent of the state's total population. They mainly reside in Surguja, Raigarh, and Bilaspur in Chhattisgarh with a lesser population.",
        "Historical evidence regarding the origin of the Korwa tribe is lacking, but Colonel Dalton has considered them to be a caste derived from the Kolarian group. According to legends, they believe their origin is from Ramsita. During the exile period, Ram, Sita, and Lakshman passed by a paddy field, and to protect the crops, a human-shaped effigy holding a bow and arrow was made. Sita asked Ram to give life to the effigy, transforming it into a human being, who became the ancestor of the Korwa tribe.",
        "The Korwa tribe mainly inhabits hilly areas, and in some plain villages, they live alongside tribes like Kanwar, Oraon, Nagesia, Munda, etc. Their houses are typically made of mud with a thatched roof. In hilly areas, the walls may also be constructed from wood and bamboo. Household items include cooking utensils, arrows, bows, axes, and bamboo baskets. Men and women traditionally have long hair, but some Korwa men in the plains have started cutting their hair. Women use Guli or groundnut oil for hair care. Gilt ornaments, such as bangles, aidha, and nose and ear ornaments, are worn by women. Men generally wear a loincloth, and women wear lugda. Their main food includes Kodo, Kutki leaves, rice, wild root vegetables, seasonal vegetables, and non-vegetarian dishes like chicken, wild birds, fish, crab, goat, and pig. They also make liquor from Mahua and drink it.",
        "The economic life of the Korwa tribe was traditionally based on food collection, wild produce collection, and hunting. Some Korvas have settled in the plains and started cultivating crops like Kodo, Kutki, Maize, Urad, Moong, etc. They also work as laborers in the fields of other tribes. Among the wild produce, they collect tubers, vegetables, mahua, pickles, gum, tendu leaves, honey, amla, etc. which are sold in the local market. Fishing and crab catching from small rivers and streams are also common during the rainy season.",
        "The Korwa tribe is divided into two exogamous subcastes, Korwa and Kodaku, and further categorized based on their residence as Pahari Korwa (mountain dwellers) and Dihari Korwa (plain dwellers). Four exogamous gotras are found among them: Hansda, Mundi, and Samat, each with its totem. The tribe follows a patriarchal system, and the ancestral home is considered local.",
        "Childbirth is considered a gift from God, and a separate hut called \"Kumba\" is built for delivery. A local midwife called \"Dogin\" assists in the delivery. The umbilical cord is cut with an arrowhead or knife, and various rituals are performed, including Chhathi on the sixth day.",
        "The marriage age is estimated to be 12-15 years for boys and 11-13 years for girls. Marriage involves stages like betrothal, soot, betrothal, marriage, and Gauna. Exchange, service marriage, infiltration, co-migration, and widow remarriage are common practices. After death, the deceased is buried, and on the 10th day, a death feast is held. The hut where the death occurred is destroyed, and a new hut is built.",
        "The Korwa tribe has its traditional caste panchayat, with the head called \"Mukhiya.\" This panchayat settles matters related to bride price, marriage, divorce, and relationships. The tribe practices rituals like planting a wooden pole during the Jhigir Mahadev festival and celebrating Dal Fori before breaking and eating pulses. Karma is their main festival, and their main deity is Karamiha. The tribe also worships Thakur Dev, Khuriarani, Shitalamata, Dulhadev, along with snakes, trees, mountains, sun, moon, earth, and rivers. Festivals like Dussehra, Navakhani, Diwali, and Holi are celebrated. They believe in ghosts and witchcraft, with a person knowledgeable about magic referred to as \"Dewar Baiga.\"",
        "Traditional dances of the Korwa tribe include Karma, Bihav, Pardhani, Rahas, accompanied by instruments like Mandar, cymbals, and flute. Folk songs like Karmageet, Vihavgeet, Phaag are prominent in their cultural practices.",
        
        "MAJHI",
        "The Majhi tribe is recognized as a Scheduled Tribe in the state of Madhya Pradesh, listed at serial number 29 in the Scheduled Tribe list. According to the 2011 census, their total population is estimated to be 50,655, constituting 0.070 percent of the total population of the state. This tribe is predominantly found in Raigarh, Bilaspur, Surguja, and Sidhi districts of undivided Madhya Pradesh. The population of the Majhi tribe in Madhya Pradesh is spread across various districts, including Sheopur, Morena, Bhind, Gwalior, Datia, Shivpuri, Guna, Tikamgarh, Chhatarpur, Panna, Sagar, Damoh, Satna, Rewa, Umaria, Shahdol, Sidhi, Neemuch, Mandsaur, Ratlam, Ujjain, Shajapur, Dewas, Jhabua, Dhar, Indore, West Nimar, Barwani, East Nimad, Rajgarh, Vidisha, Bhopal, Sehore, Raisen, Betul, Harda, Hoshgabad, Katni, Jabalpur, Narsinghpur, Dindori, Mandla, Chhindwara, Seoni, Balaghat.",
        "According to Russell, the Majhi tribe has origins in the ancestors of Gond, Munda, and Kanwar tribes. English writers have considered Majhwar and Majhi to be the same, but the Lokur Committee report of 1965 considered Majhwar as the main tribe, with Majhi as its synonym.",
        "Majhi tribe villages are typically located in hilly and forested areas, often residing alongside tribes like Gond, Majhwar, Kanwar, Munda, Nagesia, Oraon, Korwa, etc. Their houses are made of mud and wood, with grass or native tile roofs. They generally have two or three rooms, including a room for pets, with the door opening towards the back. Household items include mortar and pestle, bamboo baskets, soup bowls, clay Gagri, Kanochi, Tawa, Parai, Handiya, aluminum plates, bows, arrows, and fishing nets. Majhi men and women maintain oral hygiene using Neem or Acacia branches, bathing three to four times a week. Women often wash their hair with ritha or mud, apply oil, and tie it into a bun. Tattooing is a common practice among women. Traditional clothing includes dhoti and shirt for men and cotton saree and polka for women, although modern, readymade clothes are becoming more common. The primary food of the Majhi tribe includes rice, Kodo leaves, rice, seasonal vegetables, wild roots, fruits, and non-vegetarian dishes like pig meat, fish, and wild birds. Smoking tobacco wrapped in tendu leaves is a common practice.",
        "The livelihood of the Majhi tribe is based on hill farming, wild produce collection, agricultural labor, and other labor. They cultivate crops like paddy and urad and collect wild produce such as Mahua and Chinroji. Some Majhi individuals engage in crafts like rope-making and exchange these products for grains with other tribes. Fishing is also practiced for personal consumption.",
        "The Majhi tribe is divided into three sub-castes:",
        "1. Cole Majhi",
        "2. Turya Majhi",
        "3. Kisan Majhi",
        "The Cole Majhi considers themselves superior and is primarily engaged in primitive agriculture. Sub-castes further divide into different gotras, each with its totems, including Kekra, Khoksa, Dhanki, Badh, Sua, Ghinya, Nag, Baram, Telasi, Markam, Semaria, Kurram, Uika, Marai, etc.",
        "During pregnancy, there are no specific rituals in the Majhi tribe. Delivery typically takes place in a small hut outside the house, supervised by a midwife. The Chhathi ceremony is celebrated after the baby's umbilical cord falls. The age of marriage is generally 14-18 for boys and 12-16 for girls, and marriages are often arranged between cousins (sons and daughters of brothers and sisters). Marriage proposals are initiated by the groom's father, and marriage rituals are conducted by the Siyaan (elderly man/Baiga) of the Majhi tribe. Types of marriages include Udhariya (co-elopement), Dhuku (infiltration), Lamsena (house-in-law), and wearing bangles (remarriage).",
        "After death, the body is buried, and on the third day, the Dashava ceremony is performed. The tenth day involves shaving the hair, beard, mustache, and a death feast for the caste society.",
        "The Majhi tribe has a traditional caste panchayat, led by a \"Sian,\" which resolves matters related to marriage with other castes, divorce, and withdrawal of bridewealth. The tribe celebrates festivals like Saila, Karma, Madal, Sud Bhagat, and Gaura, with women performing the Sua dance during the Gaura festival. Men engage in stick-wielding during Holi, and young men and women perform the Karma dance during the Karma festival. Traditional musical instruments include Dhol and Madal, with songs like Sua Geet, Danda Geet, and Karma Geet sung during festivals.",
        "The main deities traditionally worshiped in the Majhi tribe include Thakur Dev, Budhi Mai, Dihasi, Ratmai, Raxel Dev, Pathdev, Bhimsen, and Dulhadev. Most of their gods and goddesses reside in the form of stone, tree, or a colorful or white flag. The tribe believes in ghosts and the mantra system. Their main festivals include Holai Navakhani, Karma, Phalgun, and Tihar.",

        "MAJHWAR",
        "The Majhwar tribe, recognized as a minority tribe in undivided Madhya Pradesh, has a total population of only 443, constituting 0.001 percent of the state's total population, according to the 2011 census. The primary habitat areas for this tribe are Surguja, Bilaspur, and Raigarh districts of the Chhattisgarh region, and it is listed at number 30 in the Scheduled Tribe list for the entire Madhya Pradesh. The Majhwar tribe can also be found in various districts of Madhya Pradesh, including Gwalior, Shivpuri, Guna, Chhatarpur, Satna, Umaria, Shahdol, Neemuch, Ujjain, Shajapur, Dewas, Indore, Barwani, East Nimad, Rajgarh, Bhopal, Sehore, Raisen, Betul, Harda, Hoshangabad, Katni, Jabalpur, Mandla, Chhindwara, Seoni, and Balaghat.",
        "The historical origin of the Majhwar tribe is not well-documented, but according to reference literature, they are considered a mixed group of Gond, Munda, and Kanwar tribes. The name \"Majhwar\" is derived from their sitting position in the middle during caste panchayats. Over time, they evolved into a separate tribe with distinct characteristics, sharing similarities with the Kolarian tribal group.",
        "Majhwar tribe villages are typically situated alongside other tribes such as Gond, Kanwar, and Oraon. Their houses are made of mud with thatched roofs made from grass or native tiles. A typical house has two or three rooms, and the walls are painted with white clay. The floor is made of mud, smeared with cow dung. Household items include cots, mills, pestles, cooking and eating utensils, axes, agricultural tools, and fishing nets. Men and women practice good hygiene, waking up in the morning to brush their teeth with sticks made of acacia or Neem and bathing daily.",
        "Women in the Majhwar tribe wash their hair with mud, apply podi, sesame, or guli oil, make a braid, and tie it. Tattooing is common on the hands, feet, and face of women, and they adorn themselves with jewelry. Traditional clothing for men includes Pancha and Bandi, while women wear Lugda and Polka. The main foods in their diet include Kodo, Kutki, rice, and Paige. They consume wild vegetables, urad, moong dal, seasonal vegetables, tuberous fruits, and non-vegetarian dishes like fish, chicken, goat, and rabbit. Liquor made from Mahua is consumed during festive occasions, and men often smoke beedis.",
        "The economic activities of the Majhwar tribe revolve around agriculture, wild produce collection, and labor. Cotton, paddy, moong, and urad are their primary agricultural produce. They collect and sell wild produce such as Mahua, Guli, Tendu leaves, Harra, gum, and tamarind. Fishing is also practiced during the rainy season.",
        "The Majhwar tribe does not have sub-castes but is divided into exogamous gotras. Some of their main gotras include Maisa, Surhi, Tati, Sahda, Bhelwa, Bagh, Jhinga, Chutru, Dumar, Nag, Khoksa, Dang, Khuta, Dhanki, Bambi, Kekra, etc., each with its totems. The local deity is Patrinivas.",
        "During pregnancy, there are no specific rites of passage, and delivery typically takes place at home under the supervision of elderly women. The umbilical cord is buried at home, and a decoction of various ingredients is given to the pregnant woman. Chhathi is celebrated on the sixth day. The age of marriage is generally considered to be 16-18 years for boys and 14-16 years for girls. The groom's side initiates the marriage proposal, and the groom's father presents grain, jaggery, oil, pulses, and cash to the bride's father as Suka Bharna. Marriage rituals include matchmaking, engagement, marriage, and Gauna, with the head of the caste conducting the phera ceremony. Various types of marriages are socially recognized, including exchange, service marriage, infiltration, co-emigration, widow remarriage, and brother-in-law and sister-in-law remarriage.",
        "In the event of death, the dead body is buried, and on the third day, male family members shave their hair, beard, and mustache. On the tenth day, after bathing, ancestors are worshiped, and a funeral feast is offered.",
        "A traditional caste panchayat exists among the Majhwar tribe, led by a \"Gotiya,\" which resolves disputes related to marriage, divorce, immoral relations, inheritance, etc., through traditional methods.",
        "The Majhwar tribe has various traditional cultural dances, including the Karma dance during Karma Puja, Bhujariya dance on Bhojali festival, Vivah dance during marriage, Rahas on Holi, and Phadki dance by women on Diwali. Major folk songs include Karma Geet, Sua Geet, Phag Geet, marriage song Dadriya, Bhajan, etc., accompanied by musical instruments like Pushp Madal, Dheel, Timki, Khartal, etc.",
        "The main deities traditionally worshiped by the Majhwar tribe include Thakur Dev, Budha Dev, Dulhadev, Bhimsen, Bagrampat, Budhi Mai, Kankalin Mai, as well as Hindu deities like Sun, Moon, Earth, River, Tree, Snake, etc. Major festivals celebrated include Hareli, Pola, Navakhani, Dussehra, Diwali, Karmapuja, Holi, and they also believe in ghosts and witchcraft. Traditional dances are performed during various festivals, and folk songs play a significant role in their cultural expressions.",

        "MAWASI",
        "The Mawasi tribe, listed at serial number 31 in the Scheduled Tribes of the state, has an estimated total population of 109,180 according to the 2011 census, constituting 0.0150 percent of the total population of the state. Predominantly residing in Chhindwara district, the Mawasi tribe is considered to be a part of the Kolarian species group, and they are found in the areas around Mahadev Mountain under the Satpura mountain range. The name \"Mawasi\" is believed to have originated from the Mawas area, where they initially resided.",
        "Although there is no clear historical evidence of the tribe's origin, a legend mentions King Ravana of Lanka, who, after pleasing Lord Shankar through penance, was instructed to carry a Shivalinga to Lanka. Lord Shiva warned that the Shivalinga should not be placed anywhere else once picked up. Ravana, becoming suspicious, temporarily placed it on Satpura hill, where Lord Shiva stabilized. In this area, Lord Mahadev is said to have created two idols, from which the Korku and Mawasi tribes originated.",
        "The Mawasi tribe predominantly lives in the foothills of mountains and plains. Their villages are divided into multiple areas, and their houses are constructed with mud walls, mud kevels for the roof, and wooden doors. Parchi, a protective barrier, is created around the house. The houses generally have two to four rooms, a verandah, and a courtyard in front. Household items include earthen stoves, cooking pots, tawas, rolling pins, ganjis, chowkis, thalis, pots, glasses, parants, pestles, grinders, soups, toknas, silbattas, ploughs, scythes, goiters, spades, trowels, axes, etc. Their main musical instruments include Dhol, Manjira, Jhanjha, Nagara, Tambura, Dafli, Timki, and Khanjari, used during dances and folk songs on various occasions.",
        "The primary food items in their diet include jowar, maize bread, kodo, kutki rice porridge, and pulses such as tuvar, urad beans, seasonal vegetables, etc. Non-vegetarian items like chicken, fish, and goat are also consumed. The Mawasi people often make their own Mahua liquor for social and religious functions.",
        "The economic activities of the Mawasi tribe revolve around agriculture, labor, collection of minor forest produce, and animal husbandry. Their rocky, sloping, and unirrigated land is used for Kharif crops such as kodo, jowar, bajra, maize, tur, urad, and jagni. They also collect forest produce like Mahua, amla, pickle, guli, mahul leaf gum, and honey, which are sold in the market.",
        "The Mawasi tribe's economic condition is considered weak, and their lives are primarily dependent on agriculture and forest produce. In the past, hunting was practiced, but it is restricted now. Fishing is currently done for personal use, and they also collect tubers for consumption.",
        "Socially, the Mawasi tribe is a branch of the Korku tribe and is divided into various exogamous clans, including Lobo, Darsia, Shilu, Akram, Choku, Jhopa Mof, Sukam, etc. Marriages within the same gotra are not allowed. There are no special rituals between pregnancy and delivery, with deliveries usually taking place at home under the supervision of neighbors and midwives. After birth, the umbilical cord is buried, and Harira is given to the pregnant woman to drink. The age of marriage is typically 16-20 years for boys and 14-16 years for girls. Marriage proposals are initiated by the boy's parents, and marriages are completed with customary rituals, including the worship of family deities.",
        "In case of death, the dead body is either buried or burned, and ashes are immersed in the Narmada or local river. On the third day, the dead soul is worshipped with kutki rice and chicken chicks by the Bhumka caste, and a death feast is organized for relatives.",
        "A traditional caste panchayat exists in the Mawasi tribe, with different members holding various positions. The chief holds the highest post, and the panchayat settles caste disputes. Collective worship of Goddess, prevention of inter-caste marriages, punishment of guilty individuals through fines and feasts are some of the functions of the panchayat. Those who do not comply with the panchayat's decisions are ostracized from the caste.",
        "Folk dance and music play a significant role in Mawasi tribe culture. They participate in festivals with other tribes, dancing Phag and Rahas during Holi, and women also dance during weddings, especially the Phadki dance. Various songs are sung on special occasions, including Vihav Geet, Phadki Geet, Bhujaliya, etc. The Mawasi tribe worships Mahadev of Pachmarhi as their main deity, along with natural gods like rivers, mountains, trees, and Hindu deities such as Ram, Hanuman, Ganesh. Local deities like Muthwa, Hardul Lala, Bhaisasur, Dulhadev, Bhimsen, Jogni Mata are also worshipped. Sacrifices and liquor are offered in these pujas. Their major festivals include Akhadi, Hariyali, Nagpanchami, Pola-Badga, Teeja, Pitrapaksha, Holi, Diwali, Bhujaliya, Rakhi, etc. Additionally, they believe in witchcraft.",
        "Traditional arts, including paintings on walls and doors, are gradually disappearing in the Mawasi tribe. Nonetheless, the tribe continues to maintain its cultural practices and rituals, reflecting their unique identity.",

        "MUNDA",
        "The Munda tribe, listed at number 33 in the Scheduled Tribes of Madhya Pradesh, is a minority in Jashpur tehsil district Raigarh and Surguja, Bilaspur districts on the north-eastern border of undivided Madhya Pradesh. According to the 2011 census in present Madhya Pradesh, the total population of the Munda tribe is estimated at 5,041, constituting 0.007 percent of the state's total population. The Munda tribe is also found in various districts across the state.",
        "The historical records regarding the origin of the Munda tribe are scarce. According to Sharat Chandra Roy, Mundas originally resided in North-West India and later migrated towards Azamgarh due to the arrival of Aryans. Eventually, they settled in the Chhota Nagpur area, including parts of undivided Madhya Pradesh, Surguja, and Raigarh forests. The Munda tribe speaks the Mundari dialect, which belongs to the Kolarian group of languages.",
        "The Munda tribe lives alongside other tribes like Oraon, Ngesiya, Kanwar, etc. Their houses are constructed with mud walls and have roofs made of native tiles. The typical house consists of two to three rooms, and the walls are painted with white clay. The floor is made of mud and covered with cow dung. Villages usually have Sarna, Akhara, and Sagan. Households are equipped with grain storage, mills, pestles, kitchen utensils, cots, clothes, agricultural tools, axes, fishing nets, and musical instruments. Men and women maintain personal hygiene by brushing their teeth daily and taking baths. Women often braid their hair, apply tattoos, and wear jewelry. In terms of clothing, men wear Pancha and Bandi, while women wear Lugda and Polka. Their primary food includes Kodo, Kutki, rice, urad, moong, tuvar dal, seasonal vegetables, and non-vegetarian items like fish, chicken, and goat meat. Handiya, a liquor made from rice, is consumed during festivals, and men often smoke beedis.",
        "The economic life of the Munda tribe revolves around agriculture, forest produce collection, and labor. They are skilled farmers, cultivating crops such as paddy, kodo, urad, moong, tuvar, and sesame. Forest produce like tendu leaves, lac, gum, harra, amla, wild tubers, and vegetables are collected and sold in local markets. Those with less agricultural land work as laborers on the farms of other tribal or non-tribal farmers. Hunting, which was practiced in the past, is now prohibited. Fish are caught during the rainy season for personal consumption.",
        "The Munda tribe follows a patrilineal, patriarchal, and patrilocal social structure, with divisions and various keelis (gotras). Major clans include Kuchwa, Bhengra, Barla, Sandigura, Amba, Dungadura, Sanga, Bodra, Walung, Guria, Kurji, Jirhul, Godli, etc. Each clan has its totems, and there is no intermarriage within a gotra.",
        "During pregnancy, there are no special rituals observed in the Munda tribe. Deliveries are conducted by local midwives and elderly women, with rituals performed on the sixth day after childbirth. Marriages are exogamous, and the age of marriage is generally 16-20 years for boys and 14-18 years for girls. The groom's side initiates the marriage proposal, and the marriage is completed in four stages – betrothal, engagement, marriage, and Gauna. The caste panchayat plays a role in resolving marriage, divorce, adultery, succession, and inter-caste marriage issues through traditional methods.",
        "In the event of death, the deceased is buried, and rituals are performed on the third and tenth days. A funeral feast is organized, and traditional caste panchayats play a role in resolving various issues through fines and banquets.",
        "The cultural traditions of the Munda tribe include folk dances, songs, and stories. They are particularly fond of dance, with folk dances performed during festivals, celebrations, marriage rituals, and worship. These dances include Karmanritya, Sarhulnritya, Sarhulgeet, Phaag, Vivahgeet, Bhajan, and more. Folk songs are sung during various rituals and festivals, and folk tales are orally transmitted, containing stories of kings, queens, demons, ghosts, lions, birds, etc.",
        "The religion of the Munda tribe exhibits animism, naturalism, and totemism. Their main deity is Singboga (Sun God), and they also worship Disulbonga, Chandiboga, Hatubonga, Orabonga. The major festivals include Karma Puja, Sarhul, Sohrai (Diwali), Magh Varan (Holi), where sacrifices of chickens and goats are made. They believe in ghosts, witchcraft, tantra-mantra, and have religious experts called \"Pahan.\" Some members have also embraced Christianity.",
        "The Munda tribe, with its rich cultural heritage, continues to practice and preserve its traditions, contributing to the diversity of Madhya Pradesh's tribal communities.",
    
        "NGESIA",
        "The Ngesiya tribe, recognized as number 34 in the Scheduled Tribes of Madhya Pradesh, is a minority tribe in undivided Madhya Pradesh, with a small population also found in Bihar. According to the 2011 census, their total population in present Madhya Pradesh is estimated at only 359, constituting 0.000 percent of the state's total population. This tribe is mainly concentrated in Raigarh and Bilaspur (now Chhattisgarh) districts of undivided Madhya Pradesh.",
        "The origin of the Ngesiya tribe is not well-documented, and there is no historical record available. According to legend, a newborn baby was thrown into the forest, and a snake protected the child from the sun by spreading its hood like an umbrella. Members of the Munda tribe found the child and raised him, and he later became the king of the Munda tribe. Due to the snake's protection, their descendants were named Ngesiya. Another interpretation suggests that the term \"Ngesiya\" is derived from \"Nag + Vasiya,\" meaning people living in the Nagpur (Chhota Nagpur) area.",
        "The Ngesiya tribe primarily resides in villages alongside other tribes like Oraon, Munda, Kanwar, Majhwar, etc. Their houses are mostly made of mud, with walls painted white, mud floors covered with cow dung, and two or three rooms including a verandah. Household items include cots, bedspreads, kitchen utensils, mills, pestles, agricultural implements, fishing nets, and axes. Women play a significant role in maintaining the cleanliness of the house.",
        "Both men and women practice daily personal hygiene, including cleaning teeth with acacia, harra, and karanj, and taking a bath. Women braid their hair, apply clay and soap for washing, and use peanut or sesame oil for their hair. Women adorn themselves with jewelry, including toe rings, anklets, waist girdles, bangles, necklaces, earrings, and nose rings, usually made of gilt. In terms of clothing, men wear pancha, bandi, dhoti, kurta, while women wear lugda and polka. The primary food of the Ngesiya tribe includes Kodon, rice, urad, tuvar dal, and seasonal vegetables, occasionally supplemented with fish, chicken, and goat meat. During festivals, rice wine (Handiya) is consumed.",
        "The economic life of the Ngesiya tribe revolves around agriculture, forest produce collection, and labor. They cultivate crops like pods, paddy, maize, urad, moong, tuvar, sesame, but the yield is limited due to unirrigated land. Forest produce such as Mahua, tendu leaves, harra, lac, and kosa are collected and sold. Landless and small farmers often work as laborers for other tribals or non-tribals.",
        "The social structure of the Ngesiya tribe follows a patriarchal, patrilineal, and patrilocal tradition. The tribe is divided into three sub-castes: Senduria, Telha, and Ghuriya. These sub-castes are considered hierarchically, with Sindooria being high, Telha medium, and Ghuriya low. Each sub-caste is further divided into several gotras, which are exogamous. Some major gotras include Kuri, Khairwara, Telia, Ghuriya, Nag, and Sindooriya.",
        "During pregnancy, there are no specific rituals, and deliveries are typically conducted at home with the assistance of local midwives. The birth of a child is celebrated with rituals on the sixth day. The marriage age for boys is generally considered to be 14-18 years, and for girls, it is 12-16 years. Marriage proposals come from the groom's side, and the groom's father provides grains, pulses, oil, jaggery, and cash to the bride's father. The marriage is completed in four stages: matchmaking, fruit donation, marriage, and Gauna. The caste head or an elderly person conducts the marriage rites. Socially accepted practices include infiltration, co-migration, exchange, and service marriage.",
        "In the event of death, the deceased is cremated, and the ashes may be taken to the Mahanadi, Sonnadi, or Ganga rivers when the economic situation allows. On the third day, after bathing, worship is performed under the guidance of a knowledgeable person known as Devar. A funeral feast is organized on the 12th day.",
        "The Ngesiya tribe has its traditional caste panchayat with a head called \"Mukhiya.\" The panchayat resolves issues related to immoral marriages, divorce disputes, and organizes worship of caste deities.",
        "The cultural specialties of the Ngesiya tribe are reflected in their dance forms, folk songs, and worship practices. The tribe is known for Sarhul dance, Karma dance during worship, Akhara dance during Karmapuja, Vihav dance at weddings, Rambhajo, and more. Folk songs include Sarhul Geet, Karma Geet, Marriage Geet, Bhajan, and they use musical instruments like Madal, Timki, and Thali.",
        "The traditional deities worshiped by the Ngesiya tribe include Gauraiyadev, Shikari Dev, Sadnamata, Dharti Mata, Annakuari, in addition to Hindu deities. The tribe celebrates festivals such as Diwali, Phagun, Sarhul, Nawakhani, Pitar, Pola, Dussehra, and holds strong beliefs in ghosts and witchcraft. Those knowledgeable in magic spells are referred to as Dewar.",
        "The vibrant cultural practices, rituals, and traditions of the Ngesiya tribe contribute to the rich tapestry of Madhya Pradesh's tribal heritage.",

        "ORAON",
        "The Oraon tribe, designated as number 35 in the Scheduled Tribe list of Madhya Pradesh, is a major tribe with a significant presence in undivided Madhya Pradesh. However, a substantial portion of their population is concentrated in Bihar, Orissa, and West Bengal. According to the 2011 census, the total Oraon population in present Madhya Pradesh is estimated at 28,431, constituting 0.039 percent of the state's total population. The primary habitat of the Oraon tribe is the eastern border of undivided Madhya Pradesh, encompassing Raigarh, Surguja, and Bilaspur districts.",
        "The origin of the Oraon tribe lacks historical records, but according to social scientists, they originally inhabited western and northern regions thousands of years ago. Over time, their ancestors migrated to Shahbad (Bhojpur) but eventually left due to Aryan pressure. They sought refuge in the plateau areas of Rohtash before moving towards Chhota Nagpur. While leaving Rohtash, they split into groups, with one passing through the banks of the Ganga and reaching the hilly areas of the palace. Another group entered Palamu (Bihar) via the plains along the Koel river. Some people from Chhota Nagpur settled in the hilly areas of Raigarh Surguja in undivided Madhya Pradesh.",
        "The Oraon tribe lives in villages alongside other tribes like Munda, Nagesia, Kanwar, Khairwar, etc. Their houses are constructed with mud walls, wood, and tile roofs. Hindu Oraons paint their house walls with black mud, while Christian Oraons use lime. The houses typically have two or three rooms, with veranda-like screens all around. The main room serves various purposes, including grain storage, a place for Gods and Goddesses, and the kitchen. Household items include utensils made of clay, aluminum, bronze, and steel, as well as stoves, tanks, pestles, mills, clothing, musical instruments like mandals, agricultural equipment, and fishing nets.",
        "Personal hygiene practices involve daily bathing for both men and women. Men keep their hair short, while women either make a bun or plait their long hair. Black soil or soap is used for hair washing. In terms of clothing, men wear short dhotis and tunics, while women wear lugdas and polkas. Young Christians may wear painted shirts, and young girls wear sarees, petticoats, and blouses. The primary food of the Oraon tribe includes rice, Kodo rice, and seasonal vegetables. Non-vegetarian dishes consist of chicken, goat meat, rabbit, etc. Rice wine is prepared and consumed during festivals, and men may smoke beedis.",
        "The economic sources of the Oraon tribe include agriculture, agricultural labor, and the collection of forest produce. They cultivate crops like Kodo Sathi paddy, Urad, Moong Kulthi, and Tuvar. Tendupatta, Mahul, Mahua, and Sal seeds are collected from the forest for sale. Educated Oraon individuals may work in government jobs, and during the rainy season, they also catch fish for personal consumption.",
        "The Oraon tribe is divided into sub-castes, with main sub-castes such as Oraon, Ghangad, Dhanka, and Koda. They are further classified based on religion as Hindu Oraons and Christian Oraons. Numerous exogamous gotras exist among them, including Lakda Tigga, Tirki Toppo, Minj, Bek, Khalmo, Kujur ikka, each with its totem.",
        "Childbirth among the Oraon tribe usually takes place at home, supervised by experienced women. The baby's umbilical cord is cut using a heated knife, provided by the mother's parents. A ritual known as Chhathi is observed on the sixth day after birth, during which the mother is fed laddus made from various ingredients. After childbirth, marriage usually occurs upon reaching adulthood. Marriage proposals come from the boy's family, and the Sook Bharna (bride price) includes liquor, goat, rice, pulses, and sarees. The marriage ceremony is conducted under the guidance of elder caste members. Christian Oraons receive teachings in the church for 3 to 7 days before the wedding. Marriages are conducted in the church, incorporating both tribal customs and Christian rituals.",
        "After death, the deceased may be buried, and in some cases, rich Hindus may opt for cremation. Relatives are called for \"Tihi Nahavan\" on the third day after death, marking the purification of the house and family. After three months, a celebration known as Gami is organized, featuring a feast for the family and villagers. In Christian culture, a priest is called at the time of death to preach, provide knowledge, and perform atonement for sins in a ceremony called Antam alan Sanskar.",
        "The Oraon tribe has traditional caste panchayats, with the head of the village-level panchayat known as Mahato. These panchayats resolve caste-related issues, marital disputes, immoral relationships, property division, and organize Sarna Puja and Karma Puja. Village-level caste panchayats collectively form Paraha Panchayat, led by a head known as Parha Raja. Additional officials include Diwan, Kotwar, Paneri, Panbharwa, and Muktawa. Cases unresolved at the village level are taken to Paraha Panchayat for resolution.",
        "The Oraon tribe possesses a distinctive culture, where parents may bring a girl to a potential groom's home for a few days. This allows the girl to assess the family and the boy, and it also serves as a test for the family's suitability for village service. Festivals are celebrated with enthusiasm, and the Oraon tribe practices rituals such as Sohrai during Diwali. Folk dances, including Karma dance and Sarhul dance, are prevalent, accompanied by folk songs like Karmageet, Sarhulgeet, Phagungeet, Sohraigeet, and Bhajan.",
        "The main deity of the Oraon tribe is Surya, and Gagam deities include Andheripat, Chandi, Gaon Devti, Pataraja, along with worship of Hindu deities like snakes and cows. Major festivals include Karma Puja, Sarhul, Dussehra, Diwali, Navakhai, Phagun, where sacrifices of goats and chickens are common. The Oraon tribe holds strong beliefs in ghosts and witchcraft, and experts in Tantra-Mantra are known as Pahan.",
        "Folk songs and dances play a significant role in Oraon tribal culture, with dances like Karmanritya, Sarhulnritya, Vivah dance, and songs like Karmageet, Sarhulgeet, Phagungeet, Sohraigeet, and Bhajan contributing to the vibrant cultural heritage of the Oraon tribe.",

        "PANIKA",
        "The Panika caste is recognized as a Scheduled Tribe in Madhya Pradesh, specifically in districts like Chhatarpur, Panna, Rewa, Satna, Shahdol, Umaria, Sidhi, Tikamgarh, Datia (Sevda Tehsil), with regional restrictions. In the remaining districts of Madhya Pradesh, they are considered a backward class. The Panika population in the Scheduled Tribe regions of Madhya Pradesh was estimated at 97,767 according to the 2011 census, making up 0.135 percent of the state's total population. The Panika caste is numbered 36 in the list of Scheduled Tribes in Madhya Pradesh.",
        "The origin of the Panika caste is not well-documented, but according to legends, they are believed to have originated from Kabirdas. The name Panika is derived from \"water + panika,\" meaning \"the one arising from water.\" Legends narrate that a weaver woman found a newborn baby in a lotus leaf at a pond, leading to the birth of the Panika caste. Some sources suggest that Panikas were originally a group initiated into Kabirpanth, distinct from the \"Gada\" caste.",
        "Panika caste members live in villages alongside other Hindus and tribes. Their houses are typically made of mud, wood, and bamboo, with tiled roofs. A typical house consists of two or three rooms. The walls are painted with white mud, and the floor is made of mud, covered with cow dung. Household items include a grain storage room, cot, cooking and eating utensils, grain grinding mill, paddy threshing wheel, and pestle. Yarn spinning wheels and cloth weaving machines are commonly found in Panika households.",
        "Personal hygiene practices include daily teeth cleaning and bathing for both men and women. Men keep their head hair short, while women keep long hair, often applying peanut or guli oil and adorning themselves with tattoos on hands and feet. In terms of clothing, men wear panchi, bandi, dhoti, kurta, while women wear lugda and polka. Their main dietary staples include Kodo, rice, stale, page, urad, tuvar, moong dal, and seasonal vegetables. The Saktaha Panika subgroup consumes non-vegetarian food like chicken and goat meat and drinks liquor made from Mahua. On the other hand, the Kaviraha Panika subgroup abstains from meat and alcohol.",
        "Traditional occupations of the Panika caste include cloth weaving, village Kotwari, agriculture, and labor. They weave cloth from yarn, sell it in local markets, and also engage in village watch duties, receiving remuneration from the government. Agriculture involves the cultivation of crops like Kodo, kutki, urad, tuvar, paddy, and maize. Additionally, Panikas may collect Mahua, tendu leaves, gum, etc., from Sidhi and Shahdol for sale.",
        "The Panika caste is divided into two groups: Shaktaha and Kaviraha. The Shaktaha group was the initial form, while the Kaviraha group consists of those who have joined the Kabir sect, following the rules of Saint Kabir and giving up vices like non-vegetarian food and alcohol. Both groups have different gotras, known as \"Kur,\" which are exogamous. Examples of Kur in Sidhi and Shahdol include Baghel, Saruba, Kuruha, Virganth, Tandia, Bhaisa, Nevla, Khairwar, Kutharia, Panaria, Padwar, Ghakhariya, Khunti, Tendu Pareva, Mogri, Son Sanwani, Sat Satwani Galmol, Ghura, and more.",
        "The Panika caste observes certain rituals during pregnancy, childbirth, and other life events. Deliveries usually take place at home, assisted by elderly women and local midwives. Rituals such as Chhathi are celebrated on the sixth day after childbirth. The marriage age for boys is generally around 16-18 years, and for girls, it is 15-17 years. Marriage proposals come from the groom's side, and the marriage ceremony is conducted in four stages: matchmaking, chari phaldaan, marriage, and Gauna. Customs like exchange, co-migration, infiltration, and service marriage are recognized. Widow remarriage, specifically brother-in-law-sister-in-law marriage, is socially accepted.",
        "After death, the deceased may be buried, and some Saktaha Panikas opt for cremation, immersing the ashes in the Son or Narmada. A funeral feast is given on the tenth day after the death, following religious worship for the peace of the deceased soul.",
        "The Panika caste has a traditional caste panchayat, led by a head, which settles disputes related to marriage, divorce, inheritance, property distribution, immoral relations, and imposes fines and social dinners as punishments.",
        "Panikas hold strong religious beliefs and practices. They worship local Hindu gods and goddesses, in addition to their own tribe's deities. Fasting and celebrations during festivals like Navratri, Dussehra, Diwali, and Holi are common. Beliefs in ghosts, witchcraft, and adherence to superstitions are present. Panika caste members participate in various cultural activities, including dance during marriage and Holi. Folk songs like Karma Geet and Suageet are sung during festivals, and a dance known as Viraha dance is performed during Pargahani dance festival. Panikas also worship Saint Kabir and perform a puja called \"Chauka.\"",
        "In summary, the Panika caste in Madhya Pradesh is a diverse community with distinct cultural practices, occupations, and beliefs, contributing to the rich tapestry of the state's social fabric.",

        "PAV",
        "The Pav tribe is one of the minority tribes in Madhya Pradesh, with their main residence area in the Shahdol district. According to the 2011 census, their total population in the state is estimated at 44,312, constituting 0.016 percent of the total population. The Pav tribe is recognized as a Scheduled Tribe for the entire state of Madhya Pradesh, listed at number 37 in the Scheduled Tribe list.",
        "The Pav tribe's population is also found in other districts, including Bilaspur, Raigarh, and Surguja in Chhattisgarh. While there are no historical records available regarding their origin, according to tribal legends, they are believed to have originated from the Pavel dynasty, giving rise to their name, Pav.",
        "People of the Pav tribe live in villages alongside other tribes like Gond, Kanwar, etc. Their houses are typically made of mud and wood, with grass or native tiles for the roof. A typical house has three to four rooms, and there are \"Parchhis\" on one side of the courtyard where domestic animals are tied. The floor of the house is made of mud, smeared with cow dung. Common household items include utensils for cooking and eating, aluminum and bronze utensils, cots, mills, coverings, bedclothes, fishing nets, agricultural equipment, and dance music instruments.",
        "Personal hygiene practices include cleaning teeth with acacia, myrtle, and neem sticks. Women wash their hair with black mud, and both men and women apply oil of Guli, sesame, etc., on the body and head. Women make braids and tie them. In terms of clothing, men wear dhoti and kurta with a turban on the head, while women wear polka and lugda. Tattoos are common among women. Their main dietary staples include Kodo, Kutki, rice, and corn drink. Pulses like urad, masoor, arhar, moong, butter, seasonal vegetables, and tuberous fruits are also part of their diet. In the non-vegetarian diet, they consume fish, chicken, and rabbit meat. During festivals, Mahuva liquor is consumed.",
        "The Pav tribe relies mainly on agriculture, wild produce collection, and labor. Their agricultural produce includes paddy, maize, jowar, Kodo, kutki, urda, moong, linseed, and rye. Due to unirrigated agricultural land, the yield is low. They collect wild produce such as Mahua, Guli, Tendupatta, Lakh, Amla, and Tamarind, selling them in the local market. Wild tuberous fruits are collected for personal use, and fishing is done in local rivers and drains during the rainy season.",
        "The Pav tribe follows a patriarchal system and is divided into gotras. Marriage within the same Gotra is prohibited. Each clan has a symbol (totem) that they worship. Some of the main gotras are Apel, Badhaiya, Kudha, Baiga, Gaina, Naravanshi, Baghel, Bodra Mudsiha Pari, Ghamriha, etc.",
        "Childbirth is considered a gift from God, and local nurses assist in deliveries. After birth, the umbilical cord is buried, and the child is bathed with lukewarm water. Nutritious laddus are made for the mother. The Chhathi ritual is celebrated on the sixth day, and on the twelfth day, the Varho ceremony is performed, including bathing, dressing in new clothes, and naming the child.",
        "Marriage in the Pav tribe is arranged by the parents. The proposal comes from the boy's side to the girl's side, and the age of marriage is typically 17-18 years for boys and 15-16 years for girls. The marriage ceremony involves the boy's father giving grains and money to the girl's father. Various forms of marriages like service marriage, exchange, remarriage, and widow remarriage are socially recognized.",
        "Death rituals involve burning the deceased, with the ashes immersed in the river. On the tenth day after death, Dashagat takes place, where relatives are fed.",
        "Traditional caste panchayats are present among the Pav tribe, with a hereditary head called \"Gautiya.\" This panchayat resolves disputes related to marriage, divorce, worship of Gods and Goddesses, immoral relations, inheritance, etc.",
        "Pav tribe members worship their major deities during Dussehra, Ramnavami, and Navratri. Sowing of sorghum is performed during Navratri, and rituals are done by a Panda. The main festivals include Hareli, Nagpanchami, Navratri, Dussehra, Diwali, and Holi. They also believe in ghosts, witchcraft, and perform various types of dances and sing folk songs during marriages and festivals. Saila, Karma Sua, etc., are the main dances, accompanied by musical instruments like Timki, Mandal, Trumpet, and Banjo during Karma dance.",

        "PARDHAN",
        "The Pardhan tribe is recognized as a Scheduled Tribe for the entire state of Madhya Pradesh, listed at number 38 in the Scheduled Tribe list. According to the 2011 census, their total population is estimated at 123,742, making up 0.170 percent of the state's total population. The majority of the Pardhan tribe resides in Mandla district, followed by lesser populations in Seoni, Chhindwara, Jabalpur, and Balaghat districts.",
        "Pardhan tribe members are also found in various other districts of Madhya Pradesh, including Sheopur, Gwalior, Guna, Tikamgarh, Chhatarpur, Panna, Sagar, Damoh, Satna, Rewa, Umaria, Shahdol, Sidhi, Mandsaur, Ratlam, Ujjain, Shajapur, Dewas, Jhabua, Dhar, Indore, Barwani, East Nimar, Rajgarh, Vidisha, Bhopal, Sehore, Raisen, Betul, Harda, Hoshangabad, Katni, Jabalpur, Narsinghpur, Dindori, Mandla, Chhindwara, Seoni, and Balaghat.",
        "While there isn't a clear historical account of their origin, legends suggest that the Pardhan caste originated from seven brothers, including Gond, Baiga, God Gowari, Agariya, Dulia, Tangrati Pardhan, etc. These brothers worshiped Budhadev, and the youngest brother, playing a musical instrument made from bamboo, sang songs in praise of Budhadev. Impressed by the music, Budhadev blessed him with proficiency in music and worship, and the descendants of this brother came to be known as the Pardhan caste.",
        "Pardhan society historically relied on the Jajmani system, earning their living by collecting grains and pulses through their work as priests and musicians for the Gond tribe. The term \"Pardhan\" is explained to mean \"Par\" (another's) and \"Dhan\" (grain), signifying their dependence on the grains of others.",
        "The Pardhan tribe lives alongside other tribes like Gond, Bharia, Baiga, etc. Their houses are typically built with mud and wood, with grass or native tiles for the roof. The walls are plastered with yellow or white mud. Households have one or two rooms, with a granary, a deity's place, and storage for clothes, musical instruments, and other items. Women handle daily cleaning duties, and both men and women practice personal hygiene, including bathing and teeth cleaning.",
        "Traditional attire for men includes kurta, dhoti, bandi, and a turban, while women wear blouses, palanka, chinti, and lugra. Women adorn themselves with jewelry like Pari, toda, a girdle, glass bangles, Kangana, Guleta, and Umetha. Tattooing is a common practice.",
        "The Pardhan tribe mainly depends on agriculture, agricultural labor, wild produce collection, animal husbandry, and various jobs for their livelihood. Their crops include Kodo, Kutki, Maize, Jowar, Paddy, Urad, and Tuvar. They are divided into three sub-castes: Raj Pardhan, Gond Pardhan, and Pothiya Pardhan. Raj Pardhan is considered the highest. They are further divided into exogamous clans, and each clan has its totems.",
        "Childbirth is considered a gift from God, and various rituals, including the Chhathi Sanskar, are performed. The age for marriage is typically 16 to 18 years for boys and 14 to 17 years for girls. Marriage involves matchmaking, fruit donation, marriage, and Gauna. Different forms of marriage, including bride marriage, exchange marriage, co-elopement, infiltration, service marriage, and re-marriage, are socially recognized.",
        "After death, the deceased is either buried or burnt, depending on their social status. The Pardhan tribe practices various rituals, including offering water on the death anniversary during Pitru Paksha. Traditional caste panchayats are present among the Pardhan tribe, dealing with matters related to worship, marriage, disputes, etc.",
        "The Pardhan tribe worships rivers, mountains, trees, local gods and goddesses, Hindu deities, and their main deity, Budhadev. They celebrate various festivals like Ramnavmi, Bidri, Akhatij, Akhadi, Jeevati, Panchami, Aathe, Pola, Pitar Paksha, Dussehra, Diwali, Mahashivratri, and Holi. Sacrifices of coconut, chicken, goat, etc., are made during these festivals. The Pardhan tribe, being primarily a musician tribe, engages in singing folk stories and songs, playing the Kingri instrument. Gaudiya dance, Saila dance, and Madani dance are also performed in various places. Their folklore includes stories from the Ramayana, Mahabharata, Alha Udal, and local tales of kings and queens.",

        
        "PARDHI",
        "The Pardhi caste, initially mentioned at serial no. 39 on the Scheduled Tribe List of Madhya Pradesh State in 1976, was later removed from the Scheduled Tribe list by the Government of India through the Scheduled Castes and Scheduled Tribes (Amendment) Act of 2002. Consequently, it is no longer recognized as a Scheduled Tribe in Bhopal, Raisen, and Sehore districts.",
        "However, Pardhis are still acknowledged as Scheduled Tribe (with regional restriction) at number 40 in the Scheduled Tribe list of Madhya Pradesh state. In districts such as Chhatarpur, Mandla, Seoni, and Dindori, along with other areas like Baihar tehsil district Balaghat, Betul, Bhaisdehi, Shahpur tehsil district Betul, Patan, and Sehora tehsil and Majholi block district Jabalpur, Katni (Murwara), and Bijaya-Radhogarh tehsil and Bahoriband, Dhimarkheda development block district Katni, Hoshangabad Babai, Sohagpur Pipariya, and Bankhedi tehsil and Kesla development block district Hoshangabad, Harsud tehsil district Harda, Pardhi is recognized as Scheduled Caste in 19 districts.",
        "According to the 2011 census, the population of Pardhi, recognized as a Scheduled Tribe, is estimated to be 5896, constituting 0.008 percent of the total population of the state. The Pardhi caste derives its name from the Sanskrit word \"Pardha,\" meaning \"hunting.\" Legend has it that Pardhi-Phans are a nomadic caste that settled in Madhya Pradesh, Maharashtra, and surrounding areas. Historical records about the origin of the Pardhi caste are scarce. Russell and Hiralal believed them to be a mixed form of Rajput and Babri castes, separated from the main caste.",
        "During the Mahabharata period, a legend suggests that Lord Mahadev, in the form of Pardhi, engaged in a hunting competition with Arjun, leading to a confrontation for the right to hunt. Arjun caught Mahadev's feet in Pardhi form, and after being pleased, Mahadev granted Arjun a boon. This legend associates the origin of the Pardhi caste with Lord Mahadev.",
        "In terms of lifestyle, Pardhi households, along with other Hindu castes, live in huts on one side of the village, typically made of mud with grass or country tile roofs. Their daily items include steel and bronze utensils, plates, bowls, glasses, pots, embroidery, bedspreads, cots, grain grinding mill, pestle, stove, bird-catching materials, net, and agricultural tools. Men and women maintain personal hygiene, and women often apply peanut oil on their hair while men cut their hair. Traditional attire includes Salukha Gamchha, dhoti, vest, and kurta for men, and lugda or saree for women. They also adorn themselves with various accessories like bangles, earrings, necklaces, and toe rings.",
        "In the past, hunting was the primary livelihood for the Pardhi caste, involving the capture of pheasants, quails, rabbits, and more for sale. However, due to hunting restrictions, the focus has shifted to labor farming and selling items like bindi and vermillion. Some Pardhi families engage in agriculture, cultivating crops like jowar, maize, wheat, urad, and moong. The caste is patriarchal, with nuclear families being more prevalent than joint families. The Pardhi caste is further divided into sub-castes, including Shikari Pardhi, Langoli Pardhi, Takankar Pardhi, Cheetah Pardhi, Bull Pardhi, Gonsai Pardhi, Monkey Pardhi, Fowler Pardhi, among others, with various exogamous gotras.",
        "Childbirth practices involve a separate hut for the woman, and the child's name is cut by the right hand with a tile or fine knife, while the umbilical cord is buried in the ground. Marriage within the same gotra is prohibited, and marriage proposals come from the boy's side to the girl's side. Marriage age is typically 14-18 years for boys and 16 years for girls. Widow remarriage is accepted, and the practice of burying the deceased is prevalent, followed by mourning rituals.",
        "The Pardhi tribe is associated with both Hindu religion and traditional primitive beliefs and religious rituals. They worship deities such as Thakur Dev, Budhadev, Chappan Kod Devi, Aghai (Durga), Markadevi, Pardhan, Sablidevi, Devi Naukot, Tetiskot, Shitaladevi, Kalidevi, Raiskotardevi, Mahakali, Gangadevi, Maliyadevi, Singbhavani, and Hindu deities Ramakrishna, Hanuman, and Shiva. They also believe in supernatural powers, ghosts, and witchcraft. Folk songs and dances are integral to their cultural expressions, including Holi, Karma, Ram Saptah dances, and Phadki dance during Diwali.",
    
        "PARJA",
        "The Parja tribe, a minority group in undivided Madhya Pradesh, is primarily concentrated in the state of Chhattisgarh, formed through the separation of Orissa, Andhra Pradesh, and Madhya Pradesh. In the 2011 census of present-day Madhya Pradesh, the Parja tribe's population was estimated at 137 Natra, accounting for 0.000 percent of the state's total population. Notably, the tribe is distributed across various districts, including Sheopur, Bhind, Gwalior, Datia, Neemuch, Shajapur, Indore, East Nimar, Rajgarh, Vidisha, Bhopal, Raisen, Betul, Hoshgabad, Katni, Jabalpur, Narsinghpur, Dindori, Mandla, Chhindwara, Seoni, and Balaghat.",
        "Historical records about the Parja tribe are scarce, but according to Russell, they are considered a sub-group of the Gond tribe. The belief is that the ancestors of the Parja tribe migrated from Bastar to Orissa. They trace their origin from the Sun, and according to Oriya opinion, \"Po + Raja = Porja,\" signifies \"Po\" as son and king, representing a group of prominent individuals in tribal villages.",
        "The Parja tribe resides in villages alongside other tribes like Madiya, Bhatra, Halba, and various castes such as Mahara, Dhakad, Ahir, in Bastar. Their dwellings typically consist of mud houses with one or two rooms, featuring roofs made from wood, thatch, or native tiles. The walls are painted with white or yellow soil, and the floor is made of mud. Household items include grain containers, grain mills, pestles, clay, and aluminum utensils, axes, farming tools, clothing, bamboo mats, and baskets.",
        "Men typically wear a small cloth wrapped around their waist, while women wear a thick cotton scarf around their waist. Some young girls have adopted the trend of wearing polka. Women tie their hair into a bun, and tattooing (Gudna) is practiced on hands, feet, and face. Gilt ornaments adorn their hands, feet, nose, neck, and ears. The primary food sources for the Parja tribe include Kodo, Madiya, rice paddy, seasonal vegetables, urad, and toor dal. In their non-vegetarian diet, they consume various birds, chicken, goat, rabbit, wild pig, and fish. Salfi, Landa, and Mahua are the liquors of choice, and men often smoke beedis.",
        "The tribe primarily cultivates Madiya, Kodo, Urad, Tuvar on mountain slopes and paddy in plain areas. Due to traditional farming methods, unirrigated and rocky land, the yield is low, prompting the collection of roots, fruits, and vegetables from the forest. They also engage in the sale of Mahua lac, tendu leaves, cocoons, gum, and some work in the fields of other farmers. Fishing during the rainy season is a common practice.",
        "The Parja tribe is further divided into sub-castes, with main subcastes including Parangi Parja, Barengi (Jodiya) Parja, Kond Parja, Gadba Parja, Didai Parja, Pengu Parja, and Ghur Parja. Ghur Parjas are specifically found in Bastar (Chhattisgarh). Sub-castes are further divided into different gotras like Badh, Kaschim, Bokra, Netam, Gohi, Padki, Nag, each having its totem. Gotras are exogamous groups, and the family is patrilineal.",
        "During pregnancy, there are no specific rites of passage in the Parja tribe. Delivery takes place at home, attended by elderly women from the village. A decoction of dry ginger, jaggery, and wild herbs is given to pregnant women. The sixth rites involve bathing children and pregnant women, accompanied by the serving of liquor to relatives.",
        "In terms of marriage, proposals are initiated by the groom's side, with boys marrying at 16-19 years and girls at 13-17 years. The consent of both parties is considered crucial. The bride's side receives rice, jaggery, pulses, and cash as bride money. The bride is escorted to the groom's house, and traditional ceremonies, including haldi application and 'phera' ritual, are conducted by an elderly person of the caste. Various forms of marriages, including exchange, service, co-escape, infiltration, widow remarriage, brother-in-law and sister-in-law remarriage, are acknowledged in the society.",
        "In the event of a death, the deceased is buried, leaving clothes, utensils, and grains at the burial site. On the third day, men shave their beard, mustache, and head hair, and on the 10th day, a funeral feast is offered following worship.",
        "The Parja tribe adheres to traditional caste panchayats, with the head of the caste panchayat holding a hereditary position. The panchayat resolves disputes related to marriage, divorce, immoral relations outside the caste, inheritance, etc., through traditional methods.",
        "The cultural uniqueness of the Parja tribe is showcased through folk dances like Parji dance, Kaksar, and marriage dances performed during various festivals. Additionally, folk songs like Relo, Karma, Dadriya, Vivah Geet, and more are integral to their cultural expression, with young men and women actively participating in dances during festivals and celebrations.",
        "The primary deity of the Parja tribe is Danteshwari, and they also worship Bhimsen Dev, Thakur Dev, Budha Dev, Budhi Mai, among others. Key festivals include Pola, Navakhani, Dussehra, Diwali, Holi, during which liquor is offered to the Gods and Goddesses. Sacrifices of chickens are performed annually, and belief in ghosts and witchcraft is prevalent. The religious priest and practitioner who removes witchcraft is referred to as Sirha.",
      
        "SAHARIYA",
        "According to the 2011 census in Madhya Pradesh, the Sahariya tribe comprises an estimated total population of 614,958, constituting 0.847 percent of the state's overall population. Primarily residing in rural areas, the tribe is recognized at number 42 in the Scheduled Tribe list of Madhya Pradesh, identified by names such as Sahariya, Sehariya, Sosia, and Saar.",
        "The Sahariyas predominantly inhabit the north-west region of the state, spanning from Sehore district to North Western Vidisha, Guna, Shivpuri, Morena, Sheopur, Vijaynagar, Karahal, and Gwalior. Notably, their population is highest in the Gwalior division. Classified as a \"Primitive Tribal Group\" by the Government of India, the Sahariya tribe has a presence in various districts, including Sheopur, Morena, Bhind, Gwalior, Datia, Shivpuri, Tikamgarh, Chhatarpur, Panna, Sagar, Damoh, Satna, Rewa, Umaria, Shahdol, Sidhi, Neemuch, Ratlam, Ujjain, Shajapur, Dewas, Jhabua, Dhar, Indore, West Nimar, Barwani, East Nimar, Rajgarh, Vidisha, Bhopal, Sehore, Raisen, Harda, Hoshgabad, Katni, Jabalpur, Narsinghpur, Dindori, Mandla, Chhindwara, and Seoni.",
        "The term \"Sahariya\" derives from the Persian word \"Sahar,\" meaning forest, reflecting their historical association with forest habitats. Although lacking historical evidence, a prevalent folk tale suggests that Sahariyas and Bhils are siblings, born to two sisters. The child of the elder sister, Bhilani, is named Bhil, and the younger sister's child, Syria, is named Sahariya. According to another story, Sahariyas consider Maharishi Valmiki as their ancestral father.",
        "Geographically, Sahariya settlements are typically located on valley hills, although they often prefer flat land with easy access to water for settlement. Their dwellings, known as Saharanas, consist of hut-shaped houses arranged in quadrilateral shapes, and multiple Saharanas form larger villages. Construction begins with digging a pit for a pillar, placing a copper coin and turmeric jaggery inside. Wooden pillars are erected, and roofs are made from locally available materials. The Sahariya house, known as a room, contains essential items such as axes, soil, aluminum utensils, clothes, and a storage room for grains.",
        "The traditional dress of Sahariya men includes a short dhoti, while women typically wear Ghaghra, Lugda, and Choli. Due to economic constraints, jewelry is less prevalent, with silver and gilt jewelry worn around the neck and hands.",
        "Given their economic challenges, Sahariya families struggle to afford two meals a day. Their diet comprises tubers, roots, and grains obtained through Mahua forests, supplemented by hunting and fishing. Jowar is a staple food, and the tribe relies on Mahuai Gulli oil. Due to their forest-based lifestyle, Sahariyas engage in activities such as woodcutting, bundle-making, hunting, and fishing. They also collect various forest products such as white musli (root), Mahua, Gillu, gum, honey, tendu leaves, grass, wood, roots, and fruits.",
        "The social organization of the Sahariya tribe centers around the family, extended family system, and Saharana (a group of extended houses). The Saharana has a Patel who serves as its head, and the Sahariya social structure follows a patriarchal, patrilocal system. With the prevalence of the nuclear family system, only children belonging to the Gotra are adopted to maintain the patrigotra tradition.",
        "Marriage practices among Sahariyas include early marriages, arranged marriages, and marriages arranged through abduction. Widow remarriage is accepted, with widows allowed to bring along their children from previous marriages. The major gotra names in the Sahariya tribe include Solakiya, Chauhan, Selia, Sanauriya, Gobariya, Barodiya, Khadiya, Mangriya, Narwariya, Ucheriya Mohar, Masaniya, Barelia, Duwariya, Karondiya, Baugaiya, Baglaya, Marwariya, Kushmoria, Saure, Pawar, Kodho, among others. Endogamy is practiced, prohibiting marriage between cousins and cousins, with a bride price system in place.",
        "The Sahariya tribe engages in various folk dances and songs, expressing their love for dance and music. Tejaji Dev is their main deity, and they also worship Bheru, Bhumiya Dev, Parit Baba, Thakur Baba, and Narsinghdev. Festivals like Ramnavami, Dussehra, Deepawali, Rakshabandhan, and Holi are celebrated with enthusiasm. Folk tales based on Raja Rani, Dev Pari, and marriage songs are popular among the Sahariya tribe.",
        "Religiously, Sahariyas consider God as the supreme deity and worship Hindu deities like Shiva, Durga, Hanuman, Ram, Krishna, and Ganesha. They also believe in witchcraft, tantra-mantra, and ghosts. Traditional caste panchayats handle disputes related to marriage, divorce, and immoral relations in the Sahariya tribe.",

        "SAUNTA",
        "Saunta is a minority tribe that originally belonged to undivided Madhya Pradesh. Presently, the population of this tribe is concentrated in the Chhattisgarh region, and there are also Saunta communities in Orissa. According to the 2011 census, the total Saunta population in Madhya Pradesh is estimated to be only 190, constituting 0.000 percent of the state's total population. The primary habitat areas for the Saunta tribe are Surguja and Bilaspur districts, which are now part of Chhattisgarh.",
        "There is limited historical information available regarding the origin of the Saunta tribe. According to legends, the tribe's roots are said to trace back to Jagannathpuri in Orissa. One legend suggests that two brothers, who were valiant soldiers in the army of the king of Puri and belonged to the Khandayat caste, migrated to Madhya Pradesh. The younger brother married a local tribal woman, and their child was named Saunta. Another legend suggests that a group separated from an existing tribal caste, forming a new one called Saunta.",
        "Saunta tribe members typically reside in villages alongside other tribes such as Gond, Dhanwar, Kanwar, etc. The villages have mud houses with thatched or locally-made tile roofs. The houses are painted with yellow or white mud, and the floor is made of mud. Generally, a Saunta house has two rooms, with a deity place in the main room. Household items include grain storage sheds, clothes, kitchen utensils, cots, and agricultural equipment. Additionally, there is usually a room for animals on the side of the house.",
        "The daily routine of Saunta men and women involves bathing in the morning after their daily activities. Women, in particular, have a fondness for jewelry and wear various ornaments on their feet, wrists, waist, ears, and nose. The tribe follows a simple dressing style, with men wearing Pancha, Saluka, Bandi, Dhoti, and Kurta, while women wear Lugda and Polka.",
        "Saunta tribe members practice primitive agriculture, collect wild produce, engage in hunting, and gather food. Presently, their economic activities are centered around agriculture, labor, and forest-based products. They cultivate crops such as Kodo, Kutki, paddy, moong, urad, tuvar, tivda, and sesame. Additionally, they collect forest products like Mahua, pickles, gum, tendu leaves, and harra for sale in local markets.",
        "The Saunta society follows a patrilineal and patriarchal system, with a local ancestral home. The tribe is divided into two sub-castes, Chhattisgarhiya and Oriya, with exogamous gotras. The birth of a child is considered a gift from God, and certain rituals, such as Chhathi Sanskar on the sixth day, are observed. Saunta marriages typically occur between the ages of 12-18 for boys and 10-16 for girls. The marriage proposal is initiated by the groom's side, and the marriage process involves various stages, including matchmaking, fruit donation, and Gauna.",
        "Upon death, the Saunta tribe follows burial customs, and rituals are performed on the eleventh day. The tribe has its own traditional caste panchayat, led by a \"Gotiya,\" whose post is hereditary. The panchayat resolves disputes within the caste, arranges worship of caste deities, and addresses issues like marriage, fruit donation, and conflicts.",
        "Saunta tribe members engage in various folk dances, such as Karma dance during Karma Puja, Vihav dance in marriages, Phadki dance by girls in Diwali, and Rahas dance by youth in Holi. Their folk songs include Karma Geet, Sua Geet, and Bihav Geet. Saunta festivals involve worshiping deities like Thakur Dev, Budha Dev, Gram Devati, Dharam Devta, and Diharinmai, along with nature and animals. Liquor is offered to the Gods, and sacrifices of cock and goat are made during their main festivals, including Hareli, Rathpuja, Pola, Pitr, Navakhani, Dussehra, Diwali, and Holi. The Saunta tribe also believes in ghosts, witchcraft, and reincarnation after death.",
 
        "SAUR",
        "The Saur tribe in Madhya Pradesh, alternatively referred to as Saur or Sauria, has a population of around 167,340, making up 0.230 percent of the total state population according to the 2011 census. The primary habitat areas of the Saur tribe include the districts of Sagar, Tikamgarh, Chhatarpur, and Damoh. Additionally, Saur communities are found in various other districts of Madhya Pradesh.",
        "The origin of the Saur tribe is not documented in historical records, but according to tribal legend, the ancestors of Rajgond, Khargond, Saur, and Sahariya were cousins. In the Sagar-Chhatarpur area, the ancestors of the Saur tribe were known as \"Banrakha,\" meaning those who live in the forest and guard it.",
        "Saur villages are typically situated around forests, where people build their houses using mud walls and thatched or locally-made tile roofs. The walls of the houses are painted with white clay. Saur villages are diverse, with inhabitants from various castes like Brahmins, Lodhi, Kumhar, Luhar, Chamar, Barber, Koshti, Kalar, etc. Saur localities are usually found at one end of the village.",
        "In terms of daily practices, people in the Saur tribe brush their teeth with Datun, bathe daily, and engage in tattooing, especially among women who get tattoos on their hands, feet, and face. Men typically wear dhoti, kurta, safa, and bandi, while women wear lugda, dhoti, and polka. Gilt and silver jewelry are common among Saur women.",
        "The main food of the Saur tribe includes wheat, jowar, millet or maize bread, seasonal vegetables, tuvar, urad dal, and wild tuberous fruits collected from the nearby forests. Non-vegetarian items such as chicken, goat meat, various birds, and fish are also part of their diet. Mahua liquor is prepared and consumed during celebrations, festivals, and marriages, and men often smoke beedis.",
        "The primary occupations of the Saur tribe are agriculture and labor. Agriculture is mainly unirrigated, and crops like maize, jowar, urad, and tuvar are cultivated. For those without much agricultural land, labor, woodcutting, and the collection of forest products like tendu leaves, gum, honey, Mahua, and Guli serve as sources of livelihood.",
        "The Saur tribe follows a patrilineal, patriarchal, and patrilocal social structure. While there is no mention of sub-castes, the Saur tribe is divided into various exogamous gotras, such as Badaiya, Gilhariya, Baiga Magaria, Kachhariya, Patwa, Sildhania, Kethora, Chanderiya, Harduva Chakardaiya, Barkha, Solakiya, and more. Gotras are often based on trees, plants, and animals.",
        "Saur tribe members do not have specific pregnancy rites. Delivery takes place at home, supervised by experienced women in the community. The baby's umbilical cord is buried at the birthplace, and the newborn is bathed and named. The age of marriage for boys is generally between 12-18 years and for girls between 10-16 years. Marriage within the same gotra is prohibited, and in earlier times, the boy's father used to provide grains and money to the girl's father as marriage expenses.",
        "In the case of death, the Saur tribe follows cremation practices, and bones are often immersed in nearby rivers or the Ganga, depending on the economic situation. Thirteenth-day rites are performed, and a Ganga feast is given.",
        "The Saur tribe has its traditional caste panchayat, with a head called Mahate. The Mahate's position is hereditary, and the panchayat resolves caste-related matters in a traditional manner.",
        "The Saur tribe maintains a belief system involving worship of Gods, Goddesses, and ancestors. They believe that worship pleases the deities and relieves them of their sufferings. Ancestor worship is prevalent on various social occasions, and the spirits of ancestors are believed to protect the family and offer guidance in dreams. Belief in witchcraft, exorcism, and reincarnation is also present. Sacrifices of a goat or rooster are made to please deities and remove infectious diseases from the village.",
        "The Saur tribe participates in various traditional dances such as marriage dance, Banara, Fagua dance during Holi, Phadki Rai dance during Diwali, etc. Folk songs, including wedding songs, birth songs, and bhajans, are integral to their cultural practices. The main deities worshiped by the Saur tribe include Dulhadev, Thakurdev, Bhavani Maa, and Bhainsasur, along with worship of natural elements and Hindu Gods and Goddesses. They celebrate festivals like Dussehra, Diwali, Makar Sakranti, Akshaya Tritiya, Ganesh Chaturthi, Dev Uthani, etc. The tribe also believes in witchcraft, ghosts, and has various folk songs, dances, and celebrations related to their cultural traditions.",
     
        "SAVRA",
        "The Savra tribe, primarily found in the Raigarh, Mahasamund, and Bilaspur districts of undivided Madhya Pradesh (now Chhattisgarh), has a total estimated population of only 881, constituting 0.001 percent of the state's population according to the 2011 census. This tribe is also present in other states like Orissa, Andhra Pradesh, West Bengal, Bihar, and Maharashtra, as indicated by census data from 2001 and 2011.",
        "The Savra tribe is considered an ancient caste in India, belonging to the Kolarian group. According to their legends, they trace their origin from Shabari of the Ramayana. The caste is also mentioned in the Mahabharata. In the Mahasamund district, Savras claim their origin from Sugriva, the monkey king of the Ramayana period. According to a legend, a member of the Savra tribe was tasked by Lord Mahadev to clear the forest for farming. However, due to hunger, he ended up eating the flesh of Nandi, the bull he was using for plowing. Mahadev, upon discovering this, cursed the tribe with perpetual hunger, associating poverty with the Savra caste.",
        "Savra tribes reside in villages alongside other tribes like Binjhwar, Kanwar, Kondh, Kharia, as well as other castes such as Adhariya, Kolta, Barber, Ahir, Dhobi, and Brahmin. Their houses are typically made of mud with thatched or native tile roofs, containing two to three rooms. The walls are painted with white or yellow mud, and the floor is made of mud covered with cow dung. Household items include grain storage, stoves, utensils made of various materials, pots, mortars, pestles, and agricultural equipment.",
        "In terms of personal grooming, men cut their head, beard, and mustache hair, while women keep their hair long and often have tattoos on their bodies. Women wear gilt, silver, and brass ornaments on various body parts. Men typically wear pancha and bandi, and women wear lugda. The main diet of the Savra tribe includes Kodo, rice cakes, seasonal vegetables, urad, moong, tuvar dal, and occasionally non-vegetarian items like chicken, goat meat, fish, deer, rabbits, and various birds. Liquor made from Mahua is consumed, and men often smoke tobacco wrapped in a leaf.",
        "The primary occupations of the Savra tribe include agricultural labor and the collection of forest produce. Their unirrigated agricultural land yields crops such as paddy, Kodo, urad, sesame, and tur. Due to limited land, the yield is insufficient for the whole year, and many work in the fields of other farmers. They also collect wild tubers and vegetables from the forest. Additionally, they engage in the collection and sale of various forest products like Mahua, Gulli, Char, Tendu leaves, Sarai seeds, and more. Fishing is also a common practice during the rainy season.",
        "In the Mahasamund district, three sub-castes are prevalent among the Savra tribe: Kala Peediya (big Savra), Aade Savra, and Thakur Savra (small). These sub-castes are monogamous groups, and they are further divided into different gotras, including Bhainsa, Bhoi, Bagh, Kundla, Vanmula, Binchi, Bagula (Hansraj), Nag, Kalasha, Surajvanshi, Guria, Bahara, Bhatiya, Hathiya, and more. The Savra tribe follows a patrilineal, patriarchal system, and their ancestral home is considered local.",
        "Pregnancy rituals are not explicitly mentioned, but delivery takes place at home under the supervision of elderly women in the family or relatives. The umbilical cord of a newborn is cut with an oyster, and the newborn and mother are bathed on the sixth day. Marriage proposals come from the groom's side, and the marriage age is typically 14-18 for boys and 12-16 for girls. The groom's father provides various items as Sook (bride money) to the bride's father. Marriage ceremonies are performed by an elderly person of the caste or Gariya (Baiga). Social recognition is given to practices like exchange, service marriage, infiltration, co-migration, widow remarriage, brother-in-law, and sister-in-law remarriage.",
        "In the case of death, the body is burnt, and the bones are immersed in the Mahanadi. Shaving and a bath are performed on the third day or the 10th day. Traditional caste panchayats exist, with officials like Mukkadam and Diwan in Raipur district. Disputes are settled through social feasts and the payment of fines.",
        "The Savra tribe engages in various folk dances, marriage dances, and Rahas dances. Forms of folk songs like Bhajan and Ramdhun are popular. The main deities worshiped by the Savra tribe include Jagannath Bhagwan, Thakur Dev, Dulhadev, Kariya Dhuruva, Mata Devala, Ghatwalin, Shabar Shabari, Sahda Dev, Bhainsasur, Samlai Mangala, Khadapath, Parupath, along with the worship of Hindu Gods and Goddesses, rivers, mountains, earth, sun, and moon. Their major festivals include Rath Yatra, Hariyali, Nagpanchami, Janmashtami, Navakhani, Dussehra, Diwali, Holi, among others. The Savra tribe also sacrifices chickens and goats in the worship of Gods and Goddesses and holds strong beliefs in ghosts and witchcraft.",
        "People of the Savra tribe participate in dances and singing during marriages, singing Fags during Holi, Rahas dances, and singing Bhajan Ramdhuni and Ramayana. Additionally, young men often sing Karma Geet and Dadriya Geet."
